#Область СлужебныйПрограммныйИнтерфейс

Функция ОбработчикиСвойствЭлементов() Экспорт
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить(МодификацияФормИдентификаторы.ТипДекорацияФормы(), ПроцедурыОбработкиСвойствДекорацииФормы());
	РезультатФункции.Вставить(МодификацияФормИдентификаторы.ТипГруппаФормы(), ПроцедурыОбработкиСвойствГруппыФормы());
	РезультатФункции.Вставить(МодификацияФормИдентификаторы.ТипКнопкаФормы(), ПроцедурыОбработкиСвойствКнопкиФормы());
	РезультатФункции.Вставить(МодификацияФормИдентификаторы.ТипТаблицаФормы(), ПроцедурыОбработкиСвойствТаблицыФормы());
	РезультатФункции.Вставить(МодификацияФормИдентификаторы.ТипПолеФормы(), ПроцедурыОбработкиСвойствПоляФормы());
	
	Возврат РезультатФункции;
КонецФункции // ОбработчикиСвойствЭлементов()

Функция ЗначенияСтандартныхПеречислений() Экспорт 
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить("Булево", ЗначенияБулево());
	РезультатФункции.Вставить(Тип("ВидПоляФормы"), ЗначенияВидПоляФормы());
	РезультатФункции.Вставить(Тип("ВидГруппыФормы"), ЗначенияВидГруппыФормы());
	РезультатФункции.Вставить(Тип("ОтображениеОбычнойГруппы"), ЗначенияОтображениеОбычнойГруппы());
	РезультатФункции.Вставить(Тип("ГруппировкаПодчиненныхЭлементовФормы"), ЗначенияГруппировкаПодчиненныхЭлементовФормы());
	РезультатФункции.Вставить(Тип("СквозноеВыравнивание"), ЗначенияСквозноеВыравнивание());
	РезультатФункции.Вставить(Тип("ПоложениеЗаголовкаЭлементаФормы"), ЗначенияПоложениеЗаголовкаЭлементаФормы());
	РезультатФункции.Вставить(Тип("ПоведениеОбычнойГруппы"), ЗначенияПоведениеОбычнойГруппы());
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияСтандартныхПеречислений()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСвойствЭлементов
	
Функция ПроцедурыОбработкиСвойствДекорацииФормы()
	РезультатФункции = Новый Структура;
	
	ПрефиксИмениОбработчика = "ОбработатьСвойствоДекорацииФормы";
	//// Основное
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Заголовок");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Вид");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Видимость");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Доступность");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ПропускатьПриВводе");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ВажностьПриОтображении");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ПоведениеПриНедоступности");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Гиперссылка");
	//// При Виде=Картинка
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Картинка");
	
	//// Использование
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Подсказка");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ОтображениеПодсказки");
	//// При Виде=Картинка
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Масштабировать");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ТекстНевыбранннойКартинки");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "РазрешитьНачалоПеретаскивания");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "РазрешитьПеретаскивание");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "СпособПеретаскиванияФайлов");
	
	//// Оформление
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ЦветТекста");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Шрифт");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ЦветФона");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ЦветРамки");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Рамка");
	
	//// Расположение
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Ширина");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Высота");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "АвтоМаксимальнаяШирина");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "АвтоМаксимальнаяВысота");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ГоризонтальноеПоложениеВГруппе");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ВертикальноеПоложениеВГруппе");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ГоризонтальноеПоложение");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ВертикальноеПоложение");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "РастягиватьПоГоризонтали");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "РастягиватьПоВертикали");
	//ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ВысотаЗаголовка");
	
	Возврат РезультатФункции;
КонецФункции // ПроцедурыОбработкиСвойствДекорацииФормы()

Функция ПроцедурыОбработкиСвойствГруппыФормы()
	РезультатФункции = Новый Структура;
	
	ПрефиксИмениОбработчика = "ОбработатьСвойствоГруппыФормы";
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Вид");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Отображение");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ОтображатьЗаголовок");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Группировка");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "РастягиватьПоГоризонтали");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Заголовок");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "СквозноеВыравнивание");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Поведение");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ЦветФона");
	
	Возврат РезультатФункции;
КонецФункции // ПроцедурыОбработкиСвойствГруппыФормы()

Функция ПроцедурыОбработкиСвойствКнопкиФормы()
	РезультатФункции = Новый Структура;
	
	Возврат РезультатФункции;
КонецФункции // ПроцедурыОбработкиСвойствКнопкиФормы()

Функция ПроцедурыОбработкиСвойствТаблицыФормы()
	РезультатФункции = Новый Структура;
	
	Возврат РезультатФункции;
КонецФункции // ПроцедурыОбработкиСвойствТаблицыФормы()

Функция ПроцедурыОбработкиСвойствПоляФормы()
	РезультатФункции = Новый Структура;
	
	ПрефиксИмениОбработчика = "ОбработатьСвойствоПоляФормы";
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ПутьКДанным");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Вид");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Заголовок");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ПоложениеЗаголовка");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "РежимВыбораИзСписка");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "МногострочныйРежим");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "АвтоМаксимальнаяШирина");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ПодсказкаВвода");
	
	Возврат РезультатФункции;
КонецФункции // ПроцедурыОбработкиСвойствПоляФормы()

Процедура ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(Обработчики, ПрефиксИмениОбработчика, ИмяСвойства)
	Обработчики.Вставить(
	  ВРег(ИмяСвойства),
	  СтрШаблон("%1%2", ПрефиксИмениОбработчика, ИмяСвойства)
	);
КонецПроцедуры // ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию()

#КонецОбласти

#Область ЗначенияСтандартныхПеречислений

Функция ЗначенияБулево()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Истина"), Истина);
	РезультатФункции.Вставить(ВРег("Ложь"), Ложь);
	РезультатФункции.Вставить(ВРег("Да"), Истина);
	РезультатФункции.Вставить(ВРег("Нет"), Ложь);

	// английский
	РезультатФункции.Вставить(ВРег("True"), Истина);
	РезультатФункции.Вставить(ВРег("False"), Ложь);
	РезультатФункции.Вставить(ВРег("Yes"), Истина);
	РезультатФункции.Вставить(ВРег("No"), Ложь);

	// Числа
	РезультатФункции.Вставить("1", Истина);
	РезультатФункции.Вставить("0", Ложь);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияБулево()

Функция ЗначенияВидПоляФормы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("ПолеHTMLДокумента"), ВидПоляФормы.ПолеHTMLДокумента);
	РезультатФункции.Вставить(ВРег("ПолеPDFДокумента"), ВидПоляФормы.ПолеPDFДокумента);
	РезультатФункции.Вставить(ВРег("ПолеВвода"), ВидПоляФормы.ПолеВвода);
	РезультатФункции.Вставить(ВРег("ПолеГеографическойСхемы"), ВидПоляФормы.ПолеГеографическойСхемы);
	РезультатФункции.Вставить(ВРег("ПолеГрафическойСхемы"), ВидПоляФормы.ПолеГрафическойСхемы);
	РезультатФункции.Вставить(ВРег("ПолеДендрограммы"), ВидПоляФормы.ПолеДендрограммы);
	РезультатФункции.Вставить(ВРег("ПолеДиаграммы"), ВидПоляФормы.ПолеДиаграммы);
	РезультатФункции.Вставить(ВРег("ПолеДиаграммыГанта"), ВидПоляФормы.ПолеДиаграммыГанта);
	РезультатФункции.Вставить(ВРег("ПолеИндикатора"), ВидПоляФормы.ПолеИндикатора);
	РезультатФункции.Вставить(ВРег("ПолеКалендаря"), ВидПоляФормы.ПолеКалендаря);
	РезультатФункции.Вставить(ВРег("ПолеКартинки"), ВидПоляФормы.ПолеКартинки);
	РезультатФункции.Вставить(ВРег("ПолеНадписи"), ВидПоляФормы.ПолеНадписи);
	РезультатФункции.Вставить(ВРег("ПолеПереключателя"), ВидПоляФормы.ПолеПереключателя);
	РезультатФункции.Вставить(ВРег("ПолеПериода"), ВидПоляФормы.ПолеПериода);
	РезультатФункции.Вставить(ВРег("ПолеПланировщика"), ВидПоляФормы.ПолеПланировщика);
	РезультатФункции.Вставить(ВРег("ПолеПолосыРегулирования"), ВидПоляФормы.ПолеПолосыРегулирования);
	РезультатФункции.Вставить(ВРег("ПолеТабличногоДокумента"), ВидПоляФормы.ПолеТабличногоДокумента);
	РезультатФункции.Вставить(ВРег("ПолеТекстовогоДокумента"), ВидПоляФормы.ПолеТекстовогоДокумента);
	РезультатФункции.Вставить(ВРег("ПолеФлажка"), ВидПоляФормы.ПолеФлажка);
	РезультатФункции.Вставить(ВРег("ПолеФорматированногоДокумента"), ВидПоляФормы.ПолеФорматированногоДокумента);
	
	// английский
	РезультатФункции.Вставить(ВРег("HTMLDocumentField"), ВидПоляФормы.ПолеHTMLДокумента);
	РезультатФункции.Вставить(ВРег("PDFDocumentField"), ВидПоляФормы.ПолеPDFДокумента);
	РезультатФункции.Вставить(ВРег("InputField"), ВидПоляФормы.ПолеВвода);
	РезультатФункции.Вставить(ВРег("GeographicalSchemaField"), ВидПоляФормы.ПолеГеографическойСхемы);
	РезультатФункции.Вставить(ВРег("GraphicalSchemaField"), ВидПоляФормы.ПолеГрафическойСхемы);
	РезультатФункции.Вставить(ВРег("DendrogramField"), ВидПоляФормы.ПолеДендрограммы);
	РезультатФункции.Вставить(ВРег("ChartField"), ВидПоляФормы.ПолеДиаграммы);
	РезультатФункции.Вставить(ВРег("GanttChartField"), ВидПоляФормы.ПолеДиаграммыГанта);
	РезультатФункции.Вставить(ВРег("ProgressBarField"), ВидПоляФормы.ПолеИндикатора);
	РезультатФункции.Вставить(ВРег("CalendarField"), ВидПоляФормы.ПолеКалендаря);
	РезультатФункции.Вставить(ВРег("PictureField"), ВидПоляФормы.ПолеКартинки);
	РезультатФункции.Вставить(ВРег("LabelField"), ВидПоляФормы.ПолеНадписи);
	РезультатФункции.Вставить(ВРег("RadioButtonField"), ВидПоляФормы.ПолеПереключателя);
	РезультатФункции.Вставить(ВРег("PeriodField"), ВидПоляФормы.ПолеПериода);
	РезультатФункции.Вставить(ВРег("PlannerField"), ВидПоляФормы.ПолеПланировщика);
	РезультатФункции.Вставить(ВРег("TrackBarField"), ВидПоляФормы.ПолеПолосыРегулирования);
	РезультатФункции.Вставить(ВРег("SpreadsheetDocumentField"), ВидПоляФормы.ПолеТабличногоДокумента);
	РезультатФункции.Вставить(ВРег("TextDocumentField"), ВидПоляФормы.ПолеТекстовогоДокумента);
	РезультатФункции.Вставить(ВРег("CheckBoxField"), ВидПоляФормы.ПолеФлажка);
	РезультатФункции.Вставить(ВРег("FormattedDocumentField"), ВидПоляФормы.ПолеФорматированногоДокумента);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияВидПоляФормы()

Функция ЗначенияВидГруппыФормы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("ГруппаКнопок"), ВидГруппыФормы.ГруппаКнопок);
	РезультатФункции.Вставить(ВРег("ГруппаКолонок"), ВидГруппыФормы.ГруппаКолонок);
	РезультатФункции.Вставить(ВРег("КоманднаяПанель"), ВидГруппыФормы.КоманднаяПанель);
	РезультатФункции.Вставить(ВРег("КонтекстноеМеню"), ВидГруппыФормы.КонтекстноеМеню);
	РезультатФункции.Вставить(ВРег("ОбычнаяГруппа"), ВидГруппыФормы.ОбычнаяГруппа);
	РезультатФункции.Вставить(ВРег("Подменю"), ВидГруппыФормы.Подменю);
	РезультатФункции.Вставить(ВРег("Страница"), ВидГруппыФормы.Страница);
	РезультатФункции.Вставить(ВРег("Страницы"), ВидГруппыФормы.Страницы);
	
	// английский
	РезультатФункции.Вставить(ВРег("ButtonGroup"), ВидГруппыФормы.ГруппаКнопок);
	РезультатФункции.Вставить(ВРег("ColumnGroup"), ВидГруппыФормы.ГруппаКолонок);
	РезультатФункции.Вставить(ВРег("CommandBar"), ВидГруппыФормы.КоманднаяПанель);
	РезультатФункции.Вставить(ВРег("ContextMenu"), ВидГруппыФормы.КонтекстноеМеню);
	РезультатФункции.Вставить(ВРег("UsualGroup"), ВидГруппыФормы.ОбычнаяГруппа);
	РезультатФункции.Вставить(ВРег("Popup"), ВидГруппыФормы.Подменю);
	РезультатФункции.Вставить(ВРег("Page"), ВидГруппыФормы.Страница);
	РезультатФункции.Вставить(ВРег("Pages"), ВидГруппыФормы.Страницы);

	Возврат РезультатФункции;
КонецФункции // ЗначенияВидГруппыФормы()

Функция ЗначенияОтображениеОбычнойГруппы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Нет"), ОтображениеОбычнойГруппы.Нет);
	РезультатФункции.Вставить(ВРег("ОбычноеВыделение"), ОтображениеОбычнойГруппы.ОбычноеВыделение);
	РезультатФункции.Вставить(ВРег("СильноеВыделение"), ОтображениеОбычнойГруппы.СильноеВыделение);
	РезультатФункции.Вставить(ВРег("СлабоеВыделение"), ОтображениеОбычнойГруппы.СлабоеВыделение);
	
	// английский
	РезультатФункции.Вставить(ВРег("None"), ОтображениеОбычнойГруппы.Нет);
	РезультатФункции.Вставить(ВРег("NormalSeparation"), ОтображениеОбычнойГруппы.ОбычноеВыделение);
	РезультатФункции.Вставить(ВРег("StrongSeparation"), ОтображениеОбычнойГруппы.СильноеВыделение);
	РезультатФункции.Вставить(ВРег("WeakSeparation"), ОтображениеОбычнойГруппы.СлабоеВыделение);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияОтображениеОбычнойГруппы()

Функция ЗначенияГруппировкаПодчиненныхЭлементовФормы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Вертикальная"), ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	РезультатФункции.Вставить(ВРег("ГоризонтальнаяВсегда"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	РезультатФункции.Вставить(ВРег("ГоризонтальнаяЕслиВозможно"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	
	// английский
	РезультатФункции.Вставить(ВРег("Vertical"), ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	РезультатФункции.Вставить(ВРег("AlwaysHorizontal"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	РезультатФункции.Вставить(ВРег("HorizontalIfPossible"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияГруппировкаПодчиненныхЭлементовФормы()

Функция ЗначенияСквозноеВыравнивание()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), СквозноеВыравнивание.Авто);
	РезультатФункции.Вставить(ВРег("Использовать"), СквозноеВыравнивание.Использовать);
	РезультатФункции.Вставить(ВРег("НеИспользовать"), СквозноеВыравнивание.НеИспользовать);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), СквозноеВыравнивание.Авто);
	РезультатФункции.Вставить(ВРег("Use"), СквозноеВыравнивание.Использовать);
	РезультатФункции.Вставить(ВРег("DontUse"), СквозноеВыравнивание.НеИспользовать);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияСквозноеВыравнивание()

Функция ЗначенияПоложениеЗаголовкаЭлементаФормы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ПоложениеЗаголовкаЭлементаФормы.Авто);
	РезультатФункции.Вставить(ВРег("Верх"), ПоложениеЗаголовкаЭлементаФормы.Верх);
	РезультатФункции.Вставить(ВРег("Лево"), ПоложениеЗаголовкаЭлементаФормы.Лево);
	РезультатФункции.Вставить(ВРег("Нет"), ПоложениеЗаголовкаЭлементаФормы.Нет);
	РезультатФункции.Вставить(ВРег("Низ"), ПоложениеЗаголовкаЭлементаФормы.Низ);
	РезультатФункции.Вставить(ВРег("Право"), ПоложениеЗаголовкаЭлементаФормы.Право);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), ПоложениеЗаголовкаЭлементаФормы.Авто);
	РезультатФункции.Вставить(ВРег("Top"), ПоложениеЗаголовкаЭлементаФормы.Верх);
	РезультатФункции.Вставить(ВРег("Left"), ПоложениеЗаголовкаЭлементаФормы.Лево);
	РезультатФункции.Вставить(ВРег("None"), ПоложениеЗаголовкаЭлементаФормы.Нет);
	РезультатФункции.Вставить(ВРег("Bottom"), ПоложениеЗаголовкаЭлементаФормы.Низ);
	РезультатФункции.Вставить(ВРег("Right"), ПоложениеЗаголовкаЭлементаФормы.Право);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияПоложениеЗаголовкаЭлементаФормы()

Функция ЗначенияПоведениеОбычнойГруппы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ПоведениеОбычнойГруппы.Авто);
	РезультатФункции.Вставить(ВРег("Всплывающая"), ПоведениеОбычнойГруппы.Всплывающая);
	РезультатФункции.Вставить(ВРег("Обычное"), ПоведениеОбычнойГруппы.Обычное);
	РезультатФункции.Вставить(ВРег("Свертываемая"), ПоведениеОбычнойГруппы.Свертываемая);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), ПоведениеОбычнойГруппы.Авто);
	РезультатФункции.Вставить(ВРег("PopUp"), ПоведениеОбычнойГруппы.Всплывающая);
	РезультатФункции.Вставить(ВРег("Usual"), ПоведениеОбычнойГруппы.Обычное);
	РезультатФункции.Вставить(ВРег("Collapsible"), ПоведениеОбычнойГруппы.Свертываемая);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияПоведениеОбычнойГруппы()

#КонецОбласти

#КонецОбласти
