#Область СлужебныйПрограммныйИнтерфейс

Функция ОбработчикиСвойствЭлементов() Экспорт
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить(МодификацияФормИдентификаторы.ТипДекорацияФормы(), ПроцедурыОбработкиСвойствДекорацииФормы());
	РезультатФункции.Вставить(МодификацияФормИдентификаторы.ТипГруппаФормы(), ПроцедурыОбработкиСвойствГруппыФормы());
	РезультатФункции.Вставить(МодификацияФормИдентификаторы.ТипКнопкаФормы(), ПроцедурыОбработкиСвойствКнопкиФормы());
	РезультатФункции.Вставить(МодификацияФормИдентификаторы.ТипТаблицаФормы(), ПроцедурыОбработкиСвойствТаблицыФормы());
	РезультатФункции.Вставить(МодификацияФормИдентификаторы.ТипПолеФормы(), ПроцедурыОбработкиСвойствПоляФормы());
	
	Возврат РезультатФункции;
КонецФункции // ОбработчикиСвойствЭлементов()

Функция ЗначенияСтандартныхПеречислений() Экспорт 
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить("Булево", ЗначенияБулево());
	РезультатФункции.Вставить(Тип("ВидПоляФормы"), ЗначенияВидПоляФормы());
	РезультатФункции.Вставить(Тип("ВидГруппыФормы"), ЗначенияВидГруппыФормы());
	РезультатФункции.Вставить(Тип("ОтображениеОбычнойГруппы"), ЗначенияОтображениеОбычнойГруппы());
	РезультатФункции.Вставить(Тип("ГруппировкаПодчиненныхЭлементовФормы"), ЗначенияГруппировкаПодчиненныхЭлементовФормы());
	РезультатФункции.Вставить(Тип("СквозноеВыравнивание"), ЗначенияСквозноеВыравнивание());
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияСтандартныхПеречислений()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСвойствЭлементов
	
Функция ПроцедурыОбработкиСвойствДекорацииФормы()
	РезультатФункции = Новый Структура;
	
	Возврат РезультатФункции;
КонецФункции // ПроцедурыОбработкиСвойствДекорацииФормы()

Функция ПроцедурыОбработкиСвойствГруппыФормы()
	РезультатФункции = Новый Структура;
	
	ПрефиксИмениОбработчика = "ОбработатьСвойствоГруппыФормы";
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Вид");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Отображение");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ОтображатьЗаголовок");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Группировка");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "РастягиватьПоГоризонтали");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Заголовок");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "СквозноеВыравнивание");

	Возврат РезультатФункции;
КонецФункции // ПроцедурыОбработкиСвойствГруппыФормы()

Функция ПроцедурыОбработкиСвойствКнопкиФормы()
	РезультатФункции = Новый Структура;
	
	Возврат РезультатФункции;
КонецФункции // ПроцедурыОбработкиСвойствКнопкиФормы()

Функция ПроцедурыОбработкиСвойствТаблицыФормы()
	РезультатФункции = Новый Структура;
	
	Возврат РезультатФункции;
КонецФункции // ПроцедурыОбработкиСвойствТаблицыФормы()

Функция ПроцедурыОбработкиСвойствПоляФормы()
	РезультатФункции = Новый Структура;
	
	ПрефиксИмениОбработчика = "ОбработатьСвойствоПоляФормы";
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "ПутьКДанным");
	ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(РезультатФункции, ПрефиксИмениОбработчика, "Вид");
	
	Возврат РезультатФункции;
КонецФункции // ПроцедурыОбработкиСвойствПоляФормы()

Процедура ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию(Обработчики, ПрефиксИмениОбработчика, ИмяСвойства)
	Обработчики.Вставить(
	  ВРег(ИмяСвойства),
	  СтрШаблон("%1%2", ПрефиксИмениОбработчика, ИмяСвойства)
	);
КонецПроцедуры // ДобавитьОписаниеПроцедурыОбработкиСвойстваПоУмолчанию()

#КонецОбласти

#Область ЗначенияСтандартныхПеречислений

Функция ЗначенияБулево()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Истина"), Истина);
	РезультатФункции.Вставить(ВРег("Ложь"), Ложь);
	РезультатФункции.Вставить(ВРег("Да"), Истина);
	РезультатФункции.Вставить(ВРег("Нет"), Ложь);

	// английский
	РезультатФункции.Вставить(ВРег("True"), Истина);
	РезультатФункции.Вставить(ВРег("False"), Ложь);
	РезультатФункции.Вставить(ВРег("Yes"), Истина);
	РезультатФункции.Вставить(ВРег("No"), Ложь);

	// Числа
	РезультатФункции.Вставить("1", Истина);
	РезультатФункции.Вставить("0", Ложь);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияБулево()

Функция ЗначенияВидПоляФормы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("ПолеHTMLДокумента"), ВидПоляФормы.ПолеHTMLДокумента);
	РезультатФункции.Вставить(ВРег("ПолеPDFДокумента"), ВидПоляФормы.ПолеPDFДокумента);
	РезультатФункции.Вставить(ВРег("ПолеВвода"), ВидПоляФормы.ПолеВвода);
	РезультатФункции.Вставить(ВРег("ПолеГеографическойСхемы"), ВидПоляФормы.ПолеГеографическойСхемы);
	РезультатФункции.Вставить(ВРег("ПолеГрафическойСхемы"), ВидПоляФормы.ПолеГрафическойСхемы);
	РезультатФункции.Вставить(ВРег("ПолеДендрограммы"), ВидПоляФормы.ПолеДендрограммы);
	РезультатФункции.Вставить(ВРег("ПолеДиаграммы"), ВидПоляФормы.ПолеДиаграммы);
	РезультатФункции.Вставить(ВРег("ПолеДиаграммыГанта"), ВидПоляФормы.ПолеДиаграммыГанта);
	РезультатФункции.Вставить(ВРег("ПолеИндикатора"), ВидПоляФормы.ПолеИндикатора);
	РезультатФункции.Вставить(ВРег("ПолеКалендаря"), ВидПоляФормы.ПолеКалендаря);
	РезультатФункции.Вставить(ВРег("ПолеКартинки"), ВидПоляФормы.ПолеКартинки);
	РезультатФункции.Вставить(ВРег("ПолеНадписи"), ВидПоляФормы.ПолеНадписи);
	РезультатФункции.Вставить(ВРег("ПолеПереключателя"), ВидПоляФормы.ПолеПереключателя);
	РезультатФункции.Вставить(ВРег("ПолеПериода"), ВидПоляФормы.ПолеПериода);
	РезультатФункции.Вставить(ВРег("ПолеПланировщика"), ВидПоляФормы.ПолеПланировщика);
	РезультатФункции.Вставить(ВРег("ПолеПолосыРегулирования"), ВидПоляФормы.ПолеПолосыРегулирования);
	РезультатФункции.Вставить(ВРег("ПолеТабличногоДокумента"), ВидПоляФормы.ПолеТабличногоДокумента);
	РезультатФункции.Вставить(ВРег("ПолеТекстовогоДокумента"), ВидПоляФормы.ПолеТекстовогоДокумента);
	РезультатФункции.Вставить(ВРег("ПолеФлажка"), ВидПоляФормы.ПолеФлажка);
	РезультатФункции.Вставить(ВРег("ПолеФорматированногоДокумента"), ВидПоляФормы.ПолеФорматированногоДокумента);
	
	// английский
	РезультатФункции.Вставить(ВРег("HTMLDocumentField"), ВидПоляФормы.ПолеHTMLДокумента);
	РезультатФункции.Вставить(ВРег("PDFDocumentField"), ВидПоляФормы.ПолеPDFДокумента);
	РезультатФункции.Вставить(ВРег("InputField"), ВидПоляФормы.ПолеВвода);
	РезультатФункции.Вставить(ВРег("GeographicalSchemaField"), ВидПоляФормы.ПолеГеографическойСхемы);
	РезультатФункции.Вставить(ВРег("GraphicalSchemaField"), ВидПоляФормы.ПолеГрафическойСхемы);
	РезультатФункции.Вставить(ВРег("DendrogramField"), ВидПоляФормы.ПолеДендрограммы);
	РезультатФункции.Вставить(ВРег("ChartField"), ВидПоляФормы.ПолеДиаграммы);
	РезультатФункции.Вставить(ВРег("GanttChartField"), ВидПоляФормы.ПолеДиаграммыГанта);
	РезультатФункции.Вставить(ВРег("ProgressBarField"), ВидПоляФормы.ПолеИндикатора);
	РезультатФункции.Вставить(ВРег("CalendarField"), ВидПоляФормы.ПолеКалендаря);
	РезультатФункции.Вставить(ВРег("PictureField"), ВидПоляФормы.ПолеКартинки);
	РезультатФункции.Вставить(ВРег("LabelField"), ВидПоляФормы.ПолеНадписи);
	РезультатФункции.Вставить(ВРег("RadioButtonField"), ВидПоляФормы.ПолеПереключателя);
	РезультатФункции.Вставить(ВРег("PeriodField"), ВидПоляФормы.ПолеПериода);
	РезультатФункции.Вставить(ВРег("PlannerField"), ВидПоляФормы.ПолеПланировщика);
	РезультатФункции.Вставить(ВРег("TrackBarField"), ВидПоляФормы.ПолеПолосыРегулирования);
	РезультатФункции.Вставить(ВРег("SpreadsheetDocumentField"), ВидПоляФормы.ПолеТабличногоДокумента);
	РезультатФункции.Вставить(ВРег("TextDocumentField"), ВидПоляФормы.ПолеТекстовогоДокумента);
	РезультатФункции.Вставить(ВРег("CheckBoxField"), ВидПоляФормы.ПолеФлажка);
	РезультатФункции.Вставить(ВРег("FormattedDocumentField"), ВидПоляФормы.ПолеФорматированногоДокумента);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияВидПоляФормы()

Функция ЗначенияВидГруппыФормы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("ГруппаКнопок"), ВидГруппыФормы.ГруппаКнопок);
	РезультатФункции.Вставить(ВРег("ГруппаКолонок"), ВидГруппыФормы.ГруппаКолонок);
	РезультатФункции.Вставить(ВРег("КоманднаяПанель"), ВидГруппыФормы.КоманднаяПанель);
	РезультатФункции.Вставить(ВРег("КонтекстноеМеню"), ВидГруппыФормы.КонтекстноеМеню);
	РезультатФункции.Вставить(ВРег("ОбычнаяГруппа"), ВидГруппыФормы.ОбычнаяГруппа);
	РезультатФункции.Вставить(ВРег("Подменю"), ВидГруппыФормы.Подменю);
	РезультатФункции.Вставить(ВРег("Страница"), ВидГруппыФормы.Страница);
	РезультатФункции.Вставить(ВРег("Страницы"), ВидГруппыФормы.Страницы);
	
	// английский
	РезультатФункции.Вставить(ВРег("ButtonGroup"), ВидГруппыФормы.ГруппаКнопок);
	РезультатФункции.Вставить(ВРег("ColumnGroup"), ВидГруппыФормы.ГруппаКолонок);
	РезультатФункции.Вставить(ВРег("CommandBar"), ВидГруппыФормы.КоманднаяПанель);
	РезультатФункции.Вставить(ВРег("ContextMenu"), ВидГруппыФормы.КонтекстноеМеню);
	РезультатФункции.Вставить(ВРег("UsualGroup"), ВидГруппыФормы.ОбычнаяГруппа);
	РезультатФункции.Вставить(ВРег("Popup"), ВидГруппыФормы.Подменю);
	РезультатФункции.Вставить(ВРег("Page"), ВидГруппыФормы.Страница);
	РезультатФункции.Вставить(ВРег("Pages"), ВидГруппыФормы.Страницы);

	Возврат РезультатФункции;
КонецФункции // ЗначенияВидГруппыФормы()

Функция ЗначенияОтображениеОбычнойГруппы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Нет"), ОтображениеОбычнойГруппы.Нет);
	РезультатФункции.Вставить(ВРег("ОбычноеВыделение"), ОтображениеОбычнойГруппы.ОбычноеВыделение);
	РезультатФункции.Вставить(ВРег("СильноеВыделение"), ОтображениеОбычнойГруппы.СильноеВыделение);
	РезультатФункции.Вставить(ВРег("СлабоеВыделение"), ОтображениеОбычнойГруппы.СлабоеВыделение);
	
	// английский
	РезультатФункции.Вставить(ВРег("None"), ОтображениеОбычнойГруппы.Нет);
	РезультатФункции.Вставить(ВРег("NormalSeparation"), ОтображениеОбычнойГруппы.ОбычноеВыделение);
	РезультатФункции.Вставить(ВРег("StrongSeparation"), ОтображениеОбычнойГруппы.СильноеВыделение);
	РезультатФункции.Вставить(ВРег("WeakSeparation"), ОтображениеОбычнойГруппы.СлабоеВыделение);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияОтображениеОбычнойГруппы()

Функция ЗначенияГруппировкаПодчиненныхЭлементовФормы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Вертикальная"), ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	РезультатФункции.Вставить(ВРег("ГоризонтальнаяВсегда"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	РезультатФункции.Вставить(ВРег("ГоризонтальнаяЕслиВозможно"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	
	// английский
	РезультатФункции.Вставить(ВРег("Vertical"), ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	РезультатФункции.Вставить(ВРег("AlwaysHorizontal"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	РезультатФункции.Вставить(ВРег("HorizontalIfPossible"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияГруппировкаПодчиненныхЭлементовФормы()

Функция ЗначенияСквозноеВыравнивание()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), СквозноеВыравнивание.Авто);
	РезультатФункции.Вставить(ВРег("Использовать"), СквозноеВыравнивание.Использовать);
	РезультатФункции.Вставить(ВРег("НеИспользовать"), СквозноеВыравнивание.НеИспользовать);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), СквозноеВыравнивание.Авто);
	РезультатФункции.Вставить(ВРег("Use"), СквозноеВыравнивание.Использовать);
	РезультатФункции.Вставить(ВРег("DontUse"), СквозноеВыравнивание.НеИспользовать);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияСквозноеВыравнивание()

#КонецОбласти

#КонецОбласти
