#Область СлужебныйПрограммныйИнтерфейс

// TODO: Добавить описание
Функция ОписанияСвойствЭлементовФормы() Экспорт 
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипГруппаФормы(), ОписанияСвойствГруппыФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипДекорацияФормы(), ОписанияСвойствДекорацииФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипКнопкаФормы(), ОписанияСвойствКнопкиФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипПолеФормы(), ОписанияСвойствПоляФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипТаблицаФормы(), ОписанияСвойствТаблицыФормы());
	
	ДополнитьОписаниеОбязательныхСвойств(РезультатФункции);
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствЭлементовФормы()

// TODO: Добавить описание
Функция ЗначенияСтандартныхПеречислений() Экспорт 
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить(Тип("Булево"), ЗначенияБулево());
	РезультатФункции.Вставить("БулевоНеопределено", ЗначенияБулевоНеопределено());
	РезультатФункции.Вставить(Тип("ВажностьПриОтображении"), ЗначенияВажностьПриОтображении());
	РезультатФункции.Вставить(Тип("ВариантВыравниванияЭлементовИЗаголовков"), ЗначенияВариантВыравниванияЭлементовИЗаголовков());
	РезультатФункции.Вставить(Тип("ВертикальноеПоложениеЭлемента"), ЗначенияВертикальноеПоложениеЭлемента());
	РезультатФункции.Вставить(Тип("ВидГруппыФормы"), ЗначенияВидГруппыФормы());
	РезультатФункции.Вставить(Тип("ВидПоляФормы"), ЗначенияВидПоляФормы());
	РезультатФункции.Вставить(Тип("ГоризонтальноеПоложениеЭлемента"), ЗначенияГоризонтальноеПоложениеЭлемента());
	РезультатФункции.Вставить(Тип("ГруппировкаПодчиненныхЭлементовФормы"), ЗначенияГруппировкаПодчиненныхЭлементовФормы());
	РезультатФункции.Вставить(Тип("ИнтервалМеждуЭлементамиФормы"), ЗначенияИнтервалМеждуЭлементамиФормы());
	РезультатФункции.Вставить(Тип("ИспользованиеТекущейСтроки"), ЗначенияИспользованиеТекущейСтроки());
	РезультатФункции.Вставить(Тип("ОтображениеГруппыКнопок"), ЗначенияОтображениеГруппыКнопок());
	РезультатФункции.Вставить(Тип("ОтображениеКнопки"), ЗначенияОтображениеКнопки());
	РезультатФункции.Вставить(Тип("ОтображениеОбычнойГруппы"), ЗначенияОтображениеОбычнойГруппы());
	РезультатФункции.Вставить(Тип("ОтображениеПодсказки"), ЗначенияОтображениеПодсказки());
	РезультатФункции.Вставить(Тип("ПоложениеЗаголовкаЭлементаФормы"), ЗначенияПоложениеЗаголовкаЭлементаФормы());
	РезультатФункции.Вставить(Тип("ПоведениеОбычнойГруппы"), ЗначенияПоведениеОбычнойГруппы());
	РезультатФункции.Вставить(Тип("СквозноеВыравнивание"), ЗначенияСквозноеВыравнивание());
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияСтандартныхПеречислений()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОписанияСвойствЭлементовФормы

#Область ГруппаФормы

Функция ОписанияСвойствГруппыФормы()
	РезультатФункции = ОписаниеСвойствЭлемента();
	
	Независимый = ЗависимостьОт(Неопределено, Неопределено);
	ЗависитОтВидГруппаКнопок = ЗависимостьОт("Type", ВидГруппыФормы.ГруппаКнопок);
	ЗависитОтВидГруппаКолонок = ЗависимостьОт("Type", ВидГруппыФормы.ГруппаКолонок);
	ЗависитОтВидКоманднаяПанель = ЗависимостьОт("Type", ВидГруппыФормы.КоманднаяПанель);
	ЗависитОтВидКонтекстноеМеню = ЗависимостьОт("Type", ВидГруппыФормы.КонтекстноеМеню);
	ЗависитОтВидОбычнаяГруппа = ЗависимостьОт("Type", ВидГруппыФормы.ОбычнаяГруппа);
	ЗависитОтВидПодменю = ЗависимостьОт("Type", ВидГруппыФормы.Подменю);
	ЗависитОтВидСтраница = ЗависимостьОт("Type", ВидГруппыФормы.Страница);
	ЗависитОтВидСтраницы = ЗависимостьОт("Type", ВидГруппыФормы.Страницы);
	
	// Раздел "Основные"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Type,Вид", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("ВидГруппыФормы"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Title,Заголовок", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Строка"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Visible,Видимость", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Enabled,Доступность", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ReadOnly,ТолькоПросмотр", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "EnableContentChange,РазрешитьИзменениеСостава", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "DisplayImportance,ВажностьПриОтображении", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("ВажностьПриОтображении"));
	
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Behavior,Поведение", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ПоведениеОбычнойГруппы"));

	ЗависимостьОтображения = Новый Массив;
	ЗависимостьОтображения.Добавить(ЗависитОтВидГруппаКнопок);
	ЗависимостьОтображения.Добавить(ЗависитОтВидОбычнаяГруппа);
	ЗависимостьОтображения.Добавить(ЗависитОтВидПодменю);
	ТипыОтображения = Новый Массив;
	ТипыОтображения.Добавить(Тип("ОтображениеГруппыКнопок"));
	ТипыОтображения.Добавить(Тип("ОтображениеОбычнойГруппы"));
	ТипыОтображения.Добавить(Тип("ОтображениеКнопки"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Representation,Отображение", МодификацияФормПовтИсп.РазделОсновные(), ЗависимостьОтображения, ТипыОтображения);

	ЗависимостьГруппировка = Новый Массив;
	ЗависимостьГруппировка.Добавить(ЗависитОтВидГруппаКолонок);
	ЗависимостьГруппировка.Добавить(ЗависитОтВидОбычнаяГруппа);
	ТипыГруппировка = Новый Массив;
	ТипыГруппировка.Добавить(Тип("ГруппировкаКолонок"));
	ТипыГруппировка.Добавить(Тип("ГруппировкаПодчиненныхЭлементовФормы"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Group,Группировка", МодификацияФормПовтИсп.РазделОсновные(), ЗависимостьГруппировка, ТипыГруппировка);

	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "United,Объединенная", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ThroughAlign,СквозноеВыравнивание", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("СквозноеВыравнивание"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "TitleDataPath,ПутьКДаннымЗаголовка", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("Строка"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "CurrentRowUse,ИспользованиеТекущейСтроки", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ИспользованиеТекущейСтроки"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "AssociatedTable,ИспользуемаяТаблица", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ТаблицаФормы"));
	
	// Раздел "Использование"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Shortcut,СочетаниеКлавиш", МодификацияФормПовтИсп.РазделИспользование(), Независимый, Тип("СочетаниеКлавиш"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ToolTip,Подсказка", МодификацияФормПовтИсп.РазделИспользование(), Независимый, Тип("Строка"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ToolTipRepresentation,ОтображениеПодсказки", МодификацияФормПовтИсп.РазделИспользование(), Независимый, Тип("ОтображениеПодсказки"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ItemsAndTitlesAlign,ВыравниваниеЭлементовИЗаголовков", МодификацияФормПовтИсп.РазделИспользование(), ЗависитОтВидОбычнаяГруппа, Тип("ВариантВыравниванияЭлементовИЗаголовков"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ShowTitle,ОтображатьЗаголовок", МодификацияФормПовтИсп.РазделИспользование(), ЗависитОтВидОбычнаяГруппа, Тип("Булево"));
	
	// Раздел "Оформление"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "TitleTextColor,ЦветТекстаЗаголовка", МодификацияФормПовтИсп.РазделОформление(), Независимый, Тип("Цвет"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "TitleFont,ШрифтЗаголовка", МодификацияФормПовтИсп.РазделОформление(), Независимый, Тип("Шрифт"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "HorizontalSpacing,ГоризонтальныйИнтервал", МодификацияФормПовтИсп.РазделОформление(), ЗависитОтВидОбычнаяГруппа, Тип("ИнтервалМеждуЭлементамиФормы"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "VerticalSpacing,VerticalSpacing", МодификацияФормПовтИсп.РазделОформление(), ЗависитОтВидОбычнаяГруппа, Тип("ИнтервалМеждуЭлементамиФормы"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "BackColor,ЦветФона", МодификацияФормПовтИсп.РазделОформление(), ЗависитОтВидОбычнаяГруппа, Тип("Цвет"));
	
	// Раздел "Расположение"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Width,Ширина", МодификацияФормПовтИсп.РазделРасположение(), Независимый, Тип("Число"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Height,Высота", МодификацияФормПовтИсп.РазделРасположение(), Независимый, Тип("Число"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "HorizontalAlignInGroup,ГоризонтальноеПоложениеВГруппе", МодификацияФормПовтИсп.РазделРасположение(), Независимый, Тип("ГоризонтальноеПоложениеЭлемента"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "VerticalAlignInGroup,ВертикальноеПоложениеВГруппе", МодификацияФормПовтИсп.РазделРасположение(), Независимый, Тип("ВертикальноеПоложениеЭлемента"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ChildItemsHorizontalAlign,ГоризонтальноеПоложениеПодчиненных ", МодификацияФормПовтИсп.РазделРасположение(), ЗависитОтВидОбычнаяГруппа, Тип("ГоризонтальноеПоложениеЭлемента"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ChildItemsVerticalAlign,ВертикальноеПоложениеПодчиненных  ", МодификацияФормПовтИсп.РазделРасположение(), ЗависитОтВидОбычнаяГруппа, Тип("ВертикальноеПоложениеЭлемента"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "HorizontalStretch,РастягиватьПоГоризонтали", МодификацияФормПовтИсп.РазделРасположение(), Независимый, "БулевоНеопределено");
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "VerticalStretch,РастягиватьПоВертикали", МодификацияФормПовтИсп.РазделРасположение(), Независимый, "БулевоНеопределено");
	
	ЗаполнитьОбязательныеСвойстваГруппыФормы(РезультатФункции);
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствГруппыФормы()

Процедура ЗаполнитьОбязательныеСвойстваГруппыФормы(ОписанияСвойствЭлемента)
	ДобавитьОбязательноеСвойство(ОписанияСвойствЭлемента, "Type", ВидГруппыФормы.ОбычнаяГруппа);
КонецПроцедуры // ЗаполнитьОбязательныеСвойстваГруппыФормы()

#КонецОбласти

#Область ДекорацияФормы
	
Функция ОписанияСвойствДекорацииФормы()
	РезультатФункции = ОписаниеСвойствЭлемента();
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствДекорацииФормы()

#КонецОбласти

#Область КнопкаФормы
	
Функция ОписанияСвойствКнопкиФормы()
	РезультатФункции = ОписаниеСвойствЭлемента();
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствКнопкиФормы()

#КонецОбласти

#Область ПолеФормы
	
Функция ОписанияСвойствПоляФормы()
	РезультатФункции = ОписаниеСвойствЭлемента();
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствПоляФормы()

#КонецОбласти

#Область ТаблицаФормы
	
Функция ОписанияСвойствТаблицыФормы()
	РезультатФункции = ОписаниеСвойствЭлемента();
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствТаблицыФормы()

#КонецОбласти

#Область ОбщиеПроцедурыФункции
	
Функция ОписаниеСвойствЭлемента()
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Свойства", Новый Соответствие);
	РезультатФункции.Вставить("СоответствиеСвойств", Новый Соответствие);
	РезультатФункции.Вставить("Разделы", Разделы());
	РезультатФункции.Вставить("ОбязательныеСвойства", Новый Соответствие);
	
	Возврат РезультатФункции;
КонецФункции // ОписаниеСвойствЭлемента()

Процедура ДобавитьОбязательноеСвойство(ОписанияСвойствЭлемента, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено)
	ОписаниеОбязательногоСвойства = Новый Структура;
	ОписаниеОбязательногоСвойства.Вставить("ЗначениеПоУмолчанию", ЗначениеПоУмолчанию);
	ОписаниеОбязательногоСвойства.Вставить("Синонимы", Новый Массив);
	ОписанияСвойствЭлемента.ОбязательныеСвойства.Вставить(ВРег(СокрЛП(ИмяСвойства)), ОписаниеОбязательногоСвойства);
КонецПроцедуры // ДобавитьОбязательноеСвойство()

Функция ЗависимостьОт(Знач ИмяПоля, Знач ЗначениеПоля)
	Если ТипЗнч(ИмяПоля) = Тип("Строка") Тогда
		ИмяПоля = ВРег(ИмяПоля);
	КонецЕсли;
	РезультатФункции = Новый Структура(
	  "ИдентификаторПоля, ЗначениеПоля",
	  ИмяПоля,
	  ЗначениеПоля
	);
	
	Возврат РезультатФункции;
КонецФункции // ЗависимостьОт()

Функция Разделы()
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделОсновные(), Новый Массив);
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделИспользование(), Новый Массив);
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделОформление(), Новый Массив);
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделРасположение(), Новый Массив);
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделСобытия(), Новый Массив);
	
	Возврат РезультатФункции;
КонецФункции // Разделы()

Процедура ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойствЭлементов, ИменаСвойстваСтрокой, ИмяРаздела, ЗависимостиТипаСвойства, ЗначенияТиповСвойства)
	ИндексОсновногоИмени = 0;
	ИменаСвойств = СтрРазделить(ИменаСвойстваСтрокой, ",");
	ИмяСвойства = СокрЛП(ИменаСвойств[ИндексОсновногоИмени]);
	ИдентификаторСвойства = ВРег(ИмяСвойства);
	
	Для Каждого Элемент Из ИменаСвойств Цикл
		ОписанияСвойствЭлементов.СоответствиеСвойств.Вставить(ВРег(СокрЛП(Элемент)), ИдентификаторСвойства);
	КонецЦикла;
	
	ОписаниеСвойства = ОписаниеСвойства();
	ОписаниеСвойства.ИмяСвойства = ИмяСвойства;
	
	Если ТипЗнч(ЗависимостиТипаСвойства) <> Тип("Массив") Тогда
		СписокЗависимостей = Новый Массив;
		СписокЗависимостей.Добавить(ЗависимостиТипаСвойства);
		СписокТипов = Новый Массив;
		СписокТипов.Добавить(ЗначенияТиповСвойства);
	Иначе
		СписокЗависимостей = ЗависимостиТипаСвойства;
		СписокТипов = ЗначенияТиповСвойства;
	КонецЕсли;
	
	ТипыСвойства = Новый Массив;
	Для Сч = 0 По СписокЗависимостей.Количество() - 1 Цикл
		ДобавитьТипСвойства(
		  ТипыСвойства, 
		  СписокЗависимостей[Сч].ИдентификаторПоля,
		  СписокЗависимостей[Сч].ЗначениеПоля,
		  СписокТипов[Сч]
		);
	КонецЦикла;
	
	ОписаниеСвойства.ТипыСвойства = ТипыСвойства;
	
	ОписанияСвойствЭлементов.Свойства.Вставить(ИдентификаторСвойства, ОписаниеСвойства);
	ОписанияСвойствЭлементов.Разделы[ИмяРаздела].Добавить(ИдентификаторСвойства);
КонецПроцедуры // ДобавитьОписаниеСвойстваЭлементаФормы()

Функция ОписаниеСвойства()
	РезультатФункции = Новый Структура;
	
	РезультатФункции.Вставить("ИмяСвойства", Неопределено);
	РезультатФункции.Вставить("ТипыСвойства", Неопределено);
	
	Возврат РезультатФункции;
КонецФункции // ОписаниеСвойства()

Процедура ДобавитьТипСвойства1(ТипыСвойства, ИмяПоля, ЗначениеПоля, Тип)
	Ключ = Новый Соответствие;
	Ключ.Вставить("ИмяПоля", ИмяПоля);
	Ключ.Вставить("ЗначениеПоля", ЗначениеПоля);
	
	ТипыСвойства.Вставить(Ключ, Тип);
КонецПроцедуры // ДобавитьТипЭлемента()

Процедура ДобавитьТипСвойства(ТипыСвойства, ИмяПоля, ЗначениеПоля, Тип)
	Зависимость = Новый Структура;
	Зависимость.Вставить("ИмяПоля", ИмяПоля);
	Зависимость.Вставить("ЗначениеПоля", ЗначениеПоля);
	Зависимость.Вставить("Тип", Тип);
	
	ТипыСвойства.Добавить(Зависимость);
КонецПроцедуры // ДобавитьТипЭлемента()

Процедура ДополнитьОписаниеОбязательныхСвойств(ОписанияСвойствЭлементов)
	Для Каждого Элемент Из ОписанияСвойствЭлементов Цикл
		ДополнитьОписаниеОбязательныхСвойствЭлемента(Элемент.Значение);
	КонецЦикла;
КонецПроцедуры // ДополнитьОписаниеОбязательныхСвойств()

Процедура ДополнитьОписаниеОбязательныхСвойствЭлемента(ОписаниеЭлемента)
	Для Каждого Элемент Из ОписаниеЭлемента.СоответствиеСвойств Цикл
		Синоним = Элемент.Ключ;
		ОбязательноеСвойство = Элемент.Значение;
		ОписаниеОбязательногоСвойства = ОписаниеЭлемента.ОбязательныеСвойства.Получить(ОбязательноеСвойство);
		Если ОписаниеОбязательногоСвойства = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеОбязательногоСвойства.Синонимы.Добавить(Синоним);
	КонецЦикла;
КонецПроцедуры // ДополнитьОписаниеОбязательныхСвойствЭлемента()

#КонецОбласти

#КонецОбласти

#Область ЗначенияСтандартныхПеречислений
	
Функция ЗначенияБулево()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Истина"), Истина);
	РезультатФункции.Вставить(ВРег("Ложь"), Ложь);
	РезультатФункции.Вставить(ВРег("Да"), Истина);
	РезультатФункции.Вставить(ВРег("Нет"), Ложь);

	// английский
	РезультатФункции.Вставить(ВРег("True"), Истина);
	РезультатФункции.Вставить(ВРег("False"), Ложь);
	РезультатФункции.Вставить(ВРег("Yes"), Истина);
	РезультатФункции.Вставить(ВРег("No"), Ложь);

	// Числа
	РезультатФункции.Вставить("1", Истина);
	РезультатФункции.Вставить("0", Ложь);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияБулево()

Функция ЗначенияБулевоНеопределено()
	РезультатФункции = ЗначенияБулево();
	
	// русский
	РезультатФункции.Вставить(ВРег("Неопределено"), Неопределено);

	// английский
	РезультатФункции.Вставить(ВРег("Undefined"), Неопределено);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияБулевоНеопределено()

Функция ЗначенияВажностьПриОтображении()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ВажностьПриОтображении.Авто);
	РезультатФункции.Вставить(ВРег("Высокая"), ВажностьПриОтображении.Высокая);
	РезультатФункции.Вставить(ВРег("Низкая"), ВажностьПриОтображении.Низкая);
	РезультатФункции.Вставить(ВРег("Обычная"), ВажностьПриОтображении.Обычная);
	РезультатФункции.Вставить(ВРег("ОченьВысокая"), ВажностьПриОтображении.ОченьВысокая);
	РезультатФункции.Вставить(ВРег("ОченьНизкая"), ВажностьПриОтображении.ОченьНизкая);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), ВажностьПриОтображении.Авто);
	РезультатФункции.Вставить(ВРег("High"), ВажностьПриОтображении.Высокая);
	РезультатФункции.Вставить(ВРег("Low"), ВажностьПриОтображении.Низкая);
	РезультатФункции.Вставить(ВРег("Usual"), ВажностьПриОтображении.Обычная);
	РезультатФункции.Вставить(ВРег("VeryHigh"), ВажностьПриОтображении.ОченьВысокая);
	РезультатФункции.Вставить(ВРег("VeryLow"), ВажностьПриОтображении.ОченьНизкая);

	Возврат РезультатФункции;
КонецФункции // ЗначенияВажностьПриОтображении()

Функция ЗначенияВариантВыравниванияЭлементовИЗаголовков()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ВариантВыравниванияЭлементовИЗаголовков.Авто);
	РезультатФункции.Вставить(ВРег("Нет"), ВариантВыравниванияЭлементовИЗаголовков.Нет);
	РезультатФункции.Вставить(ВРег("ЭлементыЛевоЗаголовкиЛево"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиЛево);
	РезультатФункции.Вставить(ВРег("ЭлементыЛевоЗаголовкиПраво"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиПраво);
	РезультатФункции.Вставить(ВРег("ЭлементыПравоЗаголовкиЛево"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиЛево);
	РезультатФункции.Вставить(ВРег("ЭлементыПравоЗаголовкиПраво"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиПраво);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), ВариантВыравниванияЭлементовИЗаголовков.Авто);
	РезультатФункции.Вставить(ВРег("None"), ВариантВыравниванияЭлементовИЗаголовков.Нет);
	РезультатФункции.Вставить(ВРег("ItemsLeftTitlesLeft"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиЛево);
	РезультатФункции.Вставить(ВРег("ItemsLeftTitlesRight"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиПраво);
	РезультатФункции.Вставить(ВРег("ItemsRightTitlesLeft"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиЛево);
	РезультатФункции.Вставить(ВРег("ItemsRightTitlesRight"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиПраво);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияВариантВыравниванияЭлементовИЗаголовков()

Функция ЗначенияВертикальноеПоложениеЭлемента()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ВертикальноеПоложениеЭлемента.Авто);
	РезультатФункции.Вставить(ВРег("Верх"), ВертикальноеПоложениеЭлемента.Верх);
	РезультатФункции.Вставить(ВРег("Низ"), ВертикальноеПоложениеЭлемента.Низ);
	РезультатФункции.Вставить(ВРег("Центр"), ВертикальноеПоложениеЭлемента.Центр);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), ВертикальноеПоложениеЭлемента.Авто);
	РезультатФункции.Вставить(ВРег("Top"), ВертикальноеПоложениеЭлемента.Верх);
	РезультатФункции.Вставить(ВРег("Bottom"), ВертикальноеПоложениеЭлемента.Низ);
	РезультатФункции.Вставить(ВРег("Center"), ВертикальноеПоложениеЭлемента.Центр);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияВертикальноеПоложениеЭлемента()

Функция ЗначенияВидГруппыФормы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("ГруппаКнопок"), ВидГруппыФормы.ГруппаКнопок);
	РезультатФункции.Вставить(ВРег("ГруппаКолонок"), ВидГруппыФормы.ГруппаКолонок);
	РезультатФункции.Вставить(ВРег("КоманднаяПанель"), ВидГруппыФормы.КоманднаяПанель);
	РезультатФункции.Вставить(ВРег("КонтекстноеМеню"), ВидГруппыФормы.КонтекстноеМеню);
	РезультатФункции.Вставить(ВРег("ОбычнаяГруппа"), ВидГруппыФормы.ОбычнаяГруппа);
	РезультатФункции.Вставить(ВРег("Подменю"), ВидГруппыФормы.Подменю);
	РезультатФункции.Вставить(ВРег("Страница"), ВидГруппыФормы.Страница);
	РезультатФункции.Вставить(ВРег("Страницы"), ВидГруппыФормы.Страницы);
	
	// английский
	РезультатФункции.Вставить(ВРег("ButtonGroup"), ВидГруппыФормы.ГруппаКнопок);
	РезультатФункции.Вставить(ВРег("ColumnGroup"), ВидГруппыФормы.ГруппаКолонок);
	РезультатФункции.Вставить(ВРег("CommandBar"), ВидГруппыФормы.КоманднаяПанель);
	РезультатФункции.Вставить(ВРег("ContextMenu"), ВидГруппыФормы.КонтекстноеМеню);
	РезультатФункции.Вставить(ВРег("UsualGroup"), ВидГруппыФормы.ОбычнаяГруппа);
	РезультатФункции.Вставить(ВРег("Popup"), ВидГруппыФормы.Подменю);
	РезультатФункции.Вставить(ВРег("Page"), ВидГруппыФормы.Страница);
	РезультатФункции.Вставить(ВРег("Pages"), ВидГруппыФормы.Страницы);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияВидГруппыФормы()

Функция ЗначенияВидПоляФормы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("ПолеHTMLДокумента"), ВидПоляФормы.ПолеHTMLДокумента);
	РезультатФункции.Вставить(ВРег("ПолеPDFДокумента"), ВидПоляФормы.ПолеPDFДокумента);
	РезультатФункции.Вставить(ВРег("ПолеВвода"), ВидПоляФормы.ПолеВвода);
	РезультатФункции.Вставить(ВРег("ПолеГеографическойСхемы"), ВидПоляФормы.ПолеГеографическойСхемы);
	РезультатФункции.Вставить(ВРег("ПолеГрафическойСхемы"), ВидПоляФормы.ПолеГрафическойСхемы);
	РезультатФункции.Вставить(ВРег("ПолеДендрограммы"), ВидПоляФормы.ПолеДендрограммы);
	РезультатФункции.Вставить(ВРег("ПолеДиаграммы"), ВидПоляФормы.ПолеДиаграммы);
	РезультатФункции.Вставить(ВРег("ПолеДиаграммыГанта"), ВидПоляФормы.ПолеДиаграммыГанта);
	РезультатФункции.Вставить(ВРег("ПолеИндикатора"), ВидПоляФормы.ПолеИндикатора);
	РезультатФункции.Вставить(ВРег("ПолеКалендаря"), ВидПоляФормы.ПолеКалендаря);
	РезультатФункции.Вставить(ВРег("ПолеКартинки"), ВидПоляФормы.ПолеКартинки);
	РезультатФункции.Вставить(ВРег("ПолеНадписи"), ВидПоляФормы.ПолеНадписи);
	РезультатФункции.Вставить(ВРег("ПолеПереключателя"), ВидПоляФормы.ПолеПереключателя);
	РезультатФункции.Вставить(ВРег("ПолеПериода"), ВидПоляФормы.ПолеПериода);
	РезультатФункции.Вставить(ВРег("ПолеПланировщика"), ВидПоляФормы.ПолеПланировщика);
	РезультатФункции.Вставить(ВРег("ПолеПолосыРегулирования"), ВидПоляФормы.ПолеПолосыРегулирования);
	РезультатФункции.Вставить(ВРег("ПолеТабличногоДокумента"), ВидПоляФормы.ПолеТабличногоДокумента);
	РезультатФункции.Вставить(ВРег("ПолеТекстовогоДокумента"), ВидПоляФормы.ПолеТекстовогоДокумента);
	РезультатФункции.Вставить(ВРег("ПолеФлажка"), ВидПоляФормы.ПолеФлажка);
	РезультатФункции.Вставить(ВРег("ПолеФорматированногоДокумента"), ВидПоляФормы.ПолеФорматированногоДокумента);
	
	// английский
	РезультатФункции.Вставить(ВРег("HTMLDocumentField"), ВидПоляФормы.ПолеHTMLДокумента);
	РезультатФункции.Вставить(ВРег("PDFDocumentField"), ВидПоляФормы.ПолеPDFДокумента);
	РезультатФункции.Вставить(ВРег("InputField"), ВидПоляФормы.ПолеВвода);
	РезультатФункции.Вставить(ВРег("GeographicalSchemaField"), ВидПоляФормы.ПолеГеографическойСхемы);
	РезультатФункции.Вставить(ВРег("GraphicalSchemaField"), ВидПоляФормы.ПолеГрафическойСхемы);
	РезультатФункции.Вставить(ВРег("DendrogramField"), ВидПоляФормы.ПолеДендрограммы);
	РезультатФункции.Вставить(ВРег("ChartField"), ВидПоляФормы.ПолеДиаграммы);
	РезультатФункции.Вставить(ВРег("GanttChartField"), ВидПоляФормы.ПолеДиаграммыГанта);
	РезультатФункции.Вставить(ВРег("ProgressBarField"), ВидПоляФормы.ПолеИндикатора);
	РезультатФункции.Вставить(ВРег("CalendarField"), ВидПоляФормы.ПолеКалендаря);
	РезультатФункции.Вставить(ВРег("PictureField"), ВидПоляФормы.ПолеКартинки);
	РезультатФункции.Вставить(ВРег("LabelField"), ВидПоляФормы.ПолеНадписи);
	РезультатФункции.Вставить(ВРег("RadioButtonField"), ВидПоляФормы.ПолеПереключателя);
	РезультатФункции.Вставить(ВРег("PeriodField"), ВидПоляФормы.ПолеПериода);
	РезультатФункции.Вставить(ВРег("PlannerField"), ВидПоляФормы.ПолеПланировщика);
	РезультатФункции.Вставить(ВРег("TrackBarField"), ВидПоляФормы.ПолеПолосыРегулирования);
	РезультатФункции.Вставить(ВРег("SpreadsheetDocumentField"), ВидПоляФормы.ПолеТабличногоДокумента);
	РезультатФункции.Вставить(ВРег("TextDocumentField"), ВидПоляФормы.ПолеТекстовогоДокумента);
	РезультатФункции.Вставить(ВРег("CheckBoxField"), ВидПоляФормы.ПолеФлажка);
	РезультатФункции.Вставить(ВРег("FormattedDocumentField"), ВидПоляФормы.ПолеФорматированногоДокумента);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияВидПоляФормы()

Функция ЗначенияГоризонтальноеПоложениеЭлемента()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ГоризонтальноеПоложениеЭлемента.Авто);
	РезультатФункции.Вставить(ВРег("Лево"), ГоризонтальноеПоложениеЭлемента.Лево);
	РезультатФункции.Вставить(ВРег("Право"), ГоризонтальноеПоложениеЭлемента.Право);
	РезультатФункции.Вставить(ВРег("Центр"), ГоризонтальноеПоложениеЭлемента.Центр);
	
	// английский
	РезультатФункции.Вставить(ВРег("Авто"), ГоризонтальноеПоложениеЭлемента.Auto);
	РезультатФункции.Вставить(ВРег("Лево"), ГоризонтальноеПоложениеЭлемента.Left);
	РезультатФункции.Вставить(ВРег("Право"), ГоризонтальноеПоложениеЭлемента.Right);
	РезультатФункции.Вставить(ВРег("Центр"), ГоризонтальноеПоложениеЭлемента.Center);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияГоризонтальноеПоложениеЭлемента()

Функция ЗначенияГруппировкаПодчиненныхЭлементовФормы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Вертикальная"), ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	РезультатФункции.Вставить(ВРег("ГоризонтальнаяВсегда"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	РезультатФункции.Вставить(ВРег("ГоризонтальнаяЕслиВозможно"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	
	// английский
	РезультатФункции.Вставить(ВРег("Vertical"), ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	РезультатФункции.Вставить(ВРег("AlwaysHorizontal"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	РезультатФункции.Вставить(ВРег("HorizontalIfPossible"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияГруппировкаПодчиненныхЭлементовФормы()

Функция ЗначенияИнтервалМеждуЭлементамиФормы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ИнтервалМеждуЭлементамиФормы.Авто);
	РезультатФункции.Вставить(ВРег("Двойной"), ИнтервалМеждуЭлементамиФормы.Двойной);
	РезультатФункции.Вставить(ВРег("Нет"), ИнтервалМеждуЭлементамиФормы.Нет);
	РезультатФункции.Вставить(ВРег("Одинарный"), ИнтервалМеждуЭлементамиФормы.Одинарный);
	РезультатФункции.Вставить(ВРег("Половинный"), ИнтервалМеждуЭлементамиФормы.Половинный);
	РезультатФункции.Вставить(ВРег("Полуторный"), ИнтервалМеждуЭлементамиФормы.Полуторный);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), ИнтервалМеждуЭлементамиФормы.Авто);
	РезультатФункции.Вставить(ВРег("Double"), ИнтервалМеждуЭлементамиФормы.Двойной);
	РезультатФункции.Вставить(ВРег("None"), ИнтервалМеждуЭлементамиФормы.Нет);
	РезультатФункции.Вставить(ВРег("Single"), ИнтервалМеждуЭлементамиФормы.Одинарный);
	РезультатФункции.Вставить(ВРег("Half"), ИнтервалМеждуЭлементамиФормы.Половинный);
	РезультатФункции.Вставить(ВРег("OneAndHalf"), ИнтервалМеждуЭлементамиФормы.Полуторный);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияИспользованиеТекущейСтроки()

Функция ЗначенияИспользованиеТекущейСтроки()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ИспользованиеТекущейСтроки.Авто);
	РезультатФункции.Вставить(ВРег("Использует"), ИспользованиеТекущейСтроки.Использует);
	РезультатФункции.Вставить(ВРег("НеИспользует"), ИспользованиеТекущейСтроки.НеИспользует);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), ИспользованиеТекущейСтроки.Авто);
	РезультатФункции.Вставить(ВРег("Use"), ИспользованиеТекущейСтроки.Использует);
	РезультатФункции.Вставить(ВРег("DontUse"), ИспользованиеТекущейСтроки.НеИспользует);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияИспользованиеТекущейСтроки()

Функция ЗначенияОтображениеГруппыКнопок()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ОтображениеГруппыКнопок.Авто);
	РезультатФункции.Вставить(ВРег("Компактное"), ОтображениеГруппыКнопок.Компактное);
	РезультатФункции.Вставить(ВРег("Обычное"), ОтображениеГруппыКнопок.Обычное);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), ОтображениеГруппыКнопок.Авто);
	РезультатФункции.Вставить(ВРег("Compact"), ОтображениеГруппыКнопок.Компактное);
	РезультатФункции.Вставить(ВРег("Usual"), ОтображениеГруппыКнопок.Обычное);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияОтображениеГруппыКнопок()

Функция ЗначенияОтображениеКнопки()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ОтображениеКнопки.Авто);
	РезультатФункции.Вставить(ВРег("Картинка"), ОтображениеКнопки.Картинка);
	РезультатФункции.Вставить(ВРег("КартинкаИТекст"), ОтображениеКнопки.КартинкаИТекст);
	РезультатФункции.Вставить(ВРег("Текст"), ОтображениеКнопки.Текст);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), ОтображениеКнопки.Авто);
	РезультатФункции.Вставить(ВРег("Picture"), ОтображениеКнопки.Картинка);
	РезультатФункции.Вставить(ВРег("PictureAndText"), ОтображениеКнопки.КартинкаИТекст);
	РезультатФункции.Вставить(ВРег("Text"), ОтображениеКнопки.Текст);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияОтображениеКнопки()

Функция ЗначенияОтображениеОбычнойГруппы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Нет"), ОтображениеОбычнойГруппы.Нет);
	РезультатФункции.Вставить(ВРег("ОбычноеВыделение"), ОтображениеОбычнойГруппы.ОбычноеВыделение);
	РезультатФункции.Вставить(ВРег("СильноеВыделение"), ОтображениеОбычнойГруппы.СильноеВыделение);
	РезультатФункции.Вставить(ВРег("СлабоеВыделение"), ОтображениеОбычнойГруппы.СлабоеВыделение);
	
	// английский
	РезультатФункции.Вставить(ВРег("None"), ОтображениеОбычнойГруппы.Нет);
	РезультатФункции.Вставить(ВРег("NormalSeparation"), ОтображениеОбычнойГруппы.ОбычноеВыделение);
	РезультатФункции.Вставить(ВРег("StrongSeparation"), ОтображениеОбычнойГруппы.СильноеВыделение);
	РезультатФункции.Вставить(ВРег("WeakSeparation"), ОтображениеОбычнойГруппы.СлабоеВыделение);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияОтображениеОбычнойГруппы()

Функция ЗначенияОтображениеПодсказки()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ОтображениеПодсказки.Авто);
	РезультатФункции.Вставить(ВРег("Всплывающая"), ОтображениеПодсказки.Всплывающая);
	РезультатФункции.Вставить(ВРег("Кнопка"), ОтображениеПодсказки.Кнопка);
	РезультатФункции.Вставить(ВРег("Нет"), ОтображениеПодсказки.Нет);
	РезультатФункции.Вставить(ВРег("ОтображатьАвто"), ОтображениеПодсказки.ОтображатьАвто);
	РезультатФункции.Вставить(ВРег("ОтображатьСверху"), ОтображениеПодсказки.ОтображатьСверху);
	РезультатФункции.Вставить(ВРег("ОтображатьСлева"), ОтображениеПодсказки.ОтображатьСлева);
	РезультатФункции.Вставить(ВРег("ОтображатьСнизу"), ОтображениеПодсказки.ОтображатьСнизу);
	РезультатФункции.Вставить(ВРег("ОтображатьСправа"), ОтображениеПодсказки.ОтображатьСправа);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), ОтображениеПодсказки.Авто);
	РезультатФункции.Вставить(ВРег("Balloon"), ОтображениеПодсказки.Всплывающая);
	РезультатФункции.Вставить(ВРег("Button"), ОтображениеПодсказки.Кнопка);
	РезультатФункции.Вставить(ВРег("None"), ОтображениеПодсказки.Нет);
	РезультатФункции.Вставить(ВРег("ShowAuto"), ОтображениеПодсказки.ОтображатьАвто);
	РезультатФункции.Вставить(ВРег("ShowTop"), ОтображениеПодсказки.ОтображатьСверху);
	РезультатФункции.Вставить(ВРег("ShowLeft"), ОтображениеПодсказки.ОтображатьСлева);
	РезультатФункции.Вставить(ВРег("ShowBottom"), ОтображениеПодсказки.ОтображатьСнизу);
	РезультатФункции.Вставить(ВРег("ShowRight"), ОтображениеПодсказки.ОтображатьСправа);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияОтображениеПодсказки()

Функция ЗначенияПоложениеЗаголовкаЭлементаФормы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ПоложениеЗаголовкаЭлементаФормы.Авто);
	РезультатФункции.Вставить(ВРег("Верх"), ПоложениеЗаголовкаЭлементаФормы.Верх);
	РезультатФункции.Вставить(ВРег("Лево"), ПоложениеЗаголовкаЭлементаФормы.Лево);
	РезультатФункции.Вставить(ВРег("Нет"), ПоложениеЗаголовкаЭлементаФормы.Нет);
	РезультатФункции.Вставить(ВРег("Низ"), ПоложениеЗаголовкаЭлементаФормы.Низ);
	РезультатФункции.Вставить(ВРег("Право"), ПоложениеЗаголовкаЭлементаФормы.Право);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), ПоложениеЗаголовкаЭлементаФормы.Авто);
	РезультатФункции.Вставить(ВРег("Top"), ПоложениеЗаголовкаЭлементаФормы.Верх);
	РезультатФункции.Вставить(ВРег("Left"), ПоложениеЗаголовкаЭлементаФормы.Лево);
	РезультатФункции.Вставить(ВРег("None"), ПоложениеЗаголовкаЭлементаФормы.Нет);
	РезультатФункции.Вставить(ВРег("Bottom"), ПоложениеЗаголовкаЭлементаФормы.Низ);
	РезультатФункции.Вставить(ВРег("Right"), ПоложениеЗаголовкаЭлементаФормы.Право);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияПоложениеЗаголовкаЭлементаФормы()

Функция ЗначенияПоведениеОбычнойГруппы()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), ПоведениеОбычнойГруппы.Авто);
	РезультатФункции.Вставить(ВРег("Всплывающая"), ПоведениеОбычнойГруппы.Всплывающая);
	РезультатФункции.Вставить(ВРег("Обычное"), ПоведениеОбычнойГруппы.Обычное);
	РезультатФункции.Вставить(ВРег("Свертываемая"), ПоведениеОбычнойГруппы.Свертываемая);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), ПоведениеОбычнойГруппы.Авто);
	РезультатФункции.Вставить(ВРег("PopUp"), ПоведениеОбычнойГруппы.Всплывающая);
	РезультатФункции.Вставить(ВРег("Usual"), ПоведениеОбычнойГруппы.Обычное);
	РезультатФункции.Вставить(ВРег("Collapsible"), ПоведениеОбычнойГруппы.Свертываемая);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияПоведениеОбычнойГруппы()

Функция ЗначенияСквозноеВыравнивание()
	РезультатФункции = Новый Соответствие;
	
	// русский
	РезультатФункции.Вставить(ВРег("Авто"), СквозноеВыравнивание.Авто);
	РезультатФункции.Вставить(ВРег("Использовать"), СквозноеВыравнивание.Использовать);
	РезультатФункции.Вставить(ВРег("НеИспользовать"), СквозноеВыравнивание.НеИспользовать);
	
	// английский
	РезультатФункции.Вставить(ВРег("Auto"), СквозноеВыравнивание.Авто);
	РезультатФункции.Вставить(ВРег("Use"), СквозноеВыравнивание.Использовать);
	РезультатФункции.Вставить(ВРег("DontUse"), СквозноеВыравнивание.НеИспользовать);
	
	Возврат РезультатФункции;
КонецФункции // ЗначенияСквозноеВыравнивание()

#КонецОбласти

#КонецОбласти

