#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Раздел содержит процедуры-обработчики событий формы: ПриСозданииНаСервере, ПриОткрытии и т.п.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИмяМакетаОписанияМодификаций = Метаданные.Обработки.ОписанияМодификацийФорм.Макеты.Документ1_ФормаДокумента;
	МакетОписанияМодификаций = Обработки.ОписанияМодификацийФорм.ПолучитьМакет(ИмяМакетаОписанияМодификаций);
	МодификацияФорм.МодифицироватьФорму(ЭтаФорма, МакетОписанияМодификаций);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Раздел содержит процедуры-обработчики элементов, расположенных в основной части формы 
// (все, что не связано с таблицами на форме).
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы
// В разделах размещаются процедуры-обработчики таблиц формы и элементов таблиц. Для процедур-обработчиков 
// каждой таблицы должен быть создан свой раздел.
#КонецОбласти

#Область ОбработчикиКомандФормы
// Раздел содержит процедуры-обработчики команд формы (имена которых задаются в свойстве Действие команд формы).
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Раздел содержит процедуры и функции, составляющие внутреннюю реализацию общего модуля. В тех случаях, 
// когда общий модуль является частью некоторой функциональной подсистемы, включающей в себя несколько 
// объектов метаданных, в этом разделе также могут быть размещены служебные экспортные процедуры и функции, 
// предназначенные только для вызова из других объектов данной подсистемы.

#КонецОбласти
