#Область СлужебныйПрограммныйИнтерфейс

Функция КоллекцияОбъектовПоПолномуИмени(ПолноеИмя) Экспорт 
	РезультатФункции = Неопределено;
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	Родитель = ОбъектМетаданных.Родитель();
	ОбъектыПоКоллекциямМетаданных = ОбъектыПоКоллекциямМетаданных();
	Для Каждого Элемент Из ОбъектыПоКоллекциямМетаданных Цикл
		КоллекцияМетаданных = Элемент.Ключ;
		Если КоллекцияМетаданных.Содержит(Родитель) Тогда
			РезультатФункции = Элемент.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатФункции;
КонецФункции // КоллекцияОбъектовПоПолномуИмени()

#Область ТипыЭлементовФормы

Функция ТипДекорацияФормы() Экспорт
	Возврат Тип("ДекорацияФормы");
КонецФункции // ТипДекорацияФормы()

Функция ТипГруппаФормы() Экспорт
	Возврат Тип("ГруппаФормы");
КонецФункции // ТипГруппаФормы()

Функция ТипКнопкаФормы() Экспорт
	Возврат Тип("КнопкаФормы");
КонецФункции // ТипКнопкаФормы()

Функция ТипТаблицаФормы() Экспорт
	Возврат Тип("ТаблицаФормы");
КонецФункции // ТипТаблицаФормы()

Функция ТипПолеФормы() Экспорт
	Возврат Тип("ПолеФормы");
КонецФункции // ТипПолеФормы()

#КонецОбласти

#Область РазделыСвойствЭлементовФормы

Функция РазделОсновные() Экспорт 
	Возврат НСтр("ru='Основные'");
КонецФункции // РазделОсновные()

Функция РазделИспользование() Экспорт 
	Возврат НСтр("ru='Использование'");
КонецФункции // РазделИспользование()

Функция РазделОформление() Экспорт 
	Возврат НСтр("ru='Оформление'");
КонецФункции // РазделОформление()

Функция РазделРасположение() Экспорт 
	Возврат НСтр("ru='Расположение'");
КонецФункции // РазделРасположение()

Функция РазделСобытия() Экспорт 
	Возврат НСтр("ru='События'");
КонецФункции // РазделСобытия()

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъектыПоКоллекциямМетаданных()
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить(Метаданные.Справочники, Справочники);
	РезультатФункции.Вставить(Метаданные.Документы, Документы);
	РезультатФункции.Вставить(Метаданные.ЖурналыДокументов, ЖурналыДокументов);
	РезультатФункции.Вставить(Метаданные.Перечисления, Перечисления);
	РезультатФункции.Вставить(Метаданные.Отчеты, Отчеты);
	РезультатФункции.Вставить(Метаданные.Обработки, Обработки);
	РезультатФункции.Вставить(Метаданные.ПланыВидовХарактеристик, ПланыВидовХарактеристик);
	РезультатФункции.Вставить(Метаданные.ПланыСчетов, ПланыСчетов);
	РезультатФункции.Вставить(Метаданные.ПланыВидовРасчета, ПланыВидовРасчета);
	РезультатФункции.Вставить(Метаданные.РегистрыСведений, РегистрыСведений);
	РезультатФункции.Вставить(Метаданные.РегистрыНакопления, РегистрыНакопления);
	РезультатФункции.Вставить(Метаданные.РегистрыБухгалтерии, РегистрыБухгалтерии);
	РезультатФункции.Вставить(Метаданные.РегистрыРасчета, РегистрыРасчета);
	РезультатФункции.Вставить(Метаданные.БизнесПроцессы, БизнесПроцессы);
	РезультатФункции.Вставить(Метаданные.Задачи, Задачи);
	РезультатФункции.Вставить(Метаданные.ОбщиеМакеты, Метаданные.ОбщиеМакеты);
	
	Возврат РезультатФункции;
КонецФункции // ОбъектыПоКоллекциямМетаданных()

#КонецОбласти

