#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьЗначениеСвойства(ЗначенияСвойств, ТипЭлемента, ИдентификаторСвойства, ПредставлениеЗначенияСвойства) Экспорт 
	ОписаниеСвойства = МодификацияФормОбработкаСвойствЭлементаПовтИсп.ОписанияСвойствЭлементовФормы().Получить(ТипЭлемента).Свойства.Получить(ИдентификаторСвойства);
	ВозможныеТипыСвойства = ОписаниеСвойства.ТипыСвойства;
	ТипСвойства = Неопределено;
	Для Каждого Элемент Из ВозможныеТипыСвойства Цикл
		Если 
			Элемент.ИмяПоля = Неопределено 
			Или (
				ЗначенияСвойств.Свойство(Элемент.ИмяПоля)
				И ЗначенияСвойств[Элемент.ИмяПоля] = Элемент.ЗначениеПоля
			)
		Тогда
			ТипСвойства = Элемент.Тип;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ЗначениеСвойства = Неопределено;
	Если ТипСвойства = Тип("Строка") Тогда
		ЗначениеСвойства = ПредставлениеЗначенияСвойства;
	ИначеЕсли ТипСвойства = Тип("ТаблицаФормы") Тогда
		ЗначениеСвойства = ПредставлениеЗначенияСвойства;
	ИначеЕсли ТипСвойства = Тип("Число") Тогда
		ТипНатуральноеЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный));
		ЗначениеСвойства = ТипНатуральноеЧисло.ПривестиЗначение(ПредставлениеЗначенияСвойства);
	ИначеЕсли ТипСвойства = Тип("СочетаниеКлавиш") Тогда
		// TODO: Реализовать обработку сочетаний клавиш
	ИначеЕсли ТипСвойства = Тип("Цвет") Тогда
		// TODO: Реализовать обработку цвета
	ИначеЕсли ТипСвойства = Тип("Шрифт") Тогда
		// TODO: Реализовать обработку шрифта
	Иначе
		ВозможныеЗначения = МодификацияФормОбработкаСвойствЭлементаПовтИсп.ЗначенияСтандартныхПеречислений().Получить(ТипСвойства);
		Если ВозможныеЗначения = Неопределено Тогда
			Шаблон = НСтр("ru='Невозможно обработать свойство ""%1"" с типом ""%2""'");
			ВызватьИсключение СтрШаблон(Шаблон, ОписаниеСвойства.ИмяСвойства, ТипСвойства);
		КонецЕсли;
		ЗначениеСвойства = ВозможныеЗначения.Получить(ВРег(ПредставлениеЗначенияСвойства));
	КонецЕсли;
	ЗначенияСвойств.Вставить(ИдентификаторСвойства, ЗначениеСвойства);
КонецПроцедуры // ДобавитьЗначениеСвойства()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

