#Область СлужебныйПрограммныйИнтерфейс

Функция ОписанияСвойствЭлементовФормы() Экспорт 
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипГруппаФормы(), ОписанияСвойствГруппыФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипДекорацияФормы(), ОписанияСвойствДекорацииФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипКнопкаФормы(), ОписанияСвойствКнопкиФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипПолеФормы(), ОписанияСвойствПоляФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипТаблицаФормы(), ОписанияСвойствТаблицыФормы());
	
	ДополнитьОписаниеОбязательныхСвойств(РезультатФункции);
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствЭлементовФормы()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ГруппаФормы
	
Функция ОписанияСвойствГруппыФормы()
	РезультатФункции = ОписаниеСвойствЭлемента();
	
	Независимый = ЗависимостьОт(Неопределено, Неопределено);
	ЗависитОтВидГруппаКнопок = ЗависимостьОт("Type", ВидГруппыФормы.ГруппаКнопок);
	ЗависитОтВидГруппаКолонок = ЗависимостьОт("Type", ВидГруппыФормы.ГруппаКолонок);
	ЗависитОтВидКоманднаяПанель = ЗависимостьОт("Type", ВидГруппыФормы.КоманднаяПанель);
	ЗависитОтВидКонтекстноеМеню = ЗависимостьОт("Type", ВидГруппыФормы.КонтекстноеМеню);
	ЗависитОтВидОбычнаяГруппа = ЗависимостьОт("Type", ВидГруппыФормы.ОбычнаяГруппа);
	ЗависитОтВидПодменю = ЗависимостьОт("Type", ВидГруппыФормы.Подменю);
	ЗависитОтВидСтраница = ЗависимостьОт("Type", ВидГруппыФормы.Страница);
	ЗависитОтВидСтраницы = ЗависимостьОт("Type", ВидГруппыФормы.Страницы);
	
	// Раздел "Основные"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Type,Вид", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("ВидГруппыФормы"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Title,Заголовок", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Строка"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Visible,Видимость", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Enabled,Доступность", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ReadOnly,ТолькоПросмотр", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "EnableContentChange,РазрешитьИзменениеСостава", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "DisplayImportance,ВажностьПриОтображении", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ВажностьПриОтображении"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Behavior,Поведение", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ПоведениеОбычнойГруппы"));
	ЗависимостьОтображения = Новый Массив;
	ЗависимостьОтображения.Добавить(ЗависитОтВидГруппаКнопок);
	ЗависимостьОтображения.Добавить(ЗависитОтВидОбычнаяГруппа);
	ЗависимостьОтображения.Добавить(ЗависитОтВидПодменю);
	ТипыОтображения = Новый Массив;
	ТипыОтображения.Добавить(Тип("ОтображениеГруппыКнопок"));
	ТипыОтображения.Добавить(Тип("ОтображениеОбычнойГруппы"));
	ТипыОтображения.Добавить(Тип("ОтображениеКнопки"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Representation,Отображение", МодификацияФормПовтИсп.РазделОсновные(), ЗависимостьОтображения, ТипыОтображения);
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Group,Группировка", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ГруппировкаПодчиненныхЭлементовФормы"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "United,Объединенная", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ThroughAlign,СквозноеВыравнивание", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("СквозноеВыравнивание"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "TitleDataPath,ПутьКДаннымЗаголовка", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("Строка"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "CurrentRowUse,ИспользованиеТекущейСтроки", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ИспользованиеТекущейСтроки"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "AssociatedTable,ИспользуемаяТаблица", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ТаблицаФормы"));
	
	// Раздел "Использование"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Shortcut,СочетаниеКлавиш", МодификацияФормПовтИсп.РазделИспользование(), Независимый, Тип("СочетаниеКлавиш"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ToolTip,Подсказка", МодификацияФормПовтИсп.РазделИспользование(), Независимый, Тип("Строка"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ToolTipRepresentation,ОтображениеПодсказки", МодификацияФормПовтИсп.РазделИспользование(), Независимый, Тип("ОтображениеПодсказки"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ItemsAndTitlesAlign,ВыравниваниеЭлементовИЗаголовков", МодификацияФормПовтИсп.РазделИспользование(), ЗависитОтВидОбычнаяГруппа, Тип("ВариантВыравниванияЭлементовИЗаголовков"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ShowTitle,ОтображатьЗаголовок", МодификацияФормПовтИсп.РазделИспользование(), ЗависитОтВидОбычнаяГруппа, Тип("Булево"));
	
	// Раздел "Оформление"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "TitleTextColor,ЦветТекстаЗаголовка", МодификацияФормПовтИсп.РазделОформление(), Независимый, Тип("Цвет"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "TitleFont,ШрифтЗаголовка", МодификацияФормПовтИсп.РазделОформление(), Независимый, Тип("Шрифт"));
	
	// Раздел "Расположение"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Width,Ширина", МодификацияФормПовтИсп.РазделРасположение(), Независимый, Тип("Число"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Height,Высота", МодификацияФормПовтИсп.РазделРасположение(), Независимый, Тип("Число"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "HorizontalAlignInGroup,ГоризонтальноеПоложениеВГруппе", МодификацияФормПовтИсп.РазделРасположение(), Независимый, Тип("ГоризонтальноеПоложениеЭлемента"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "VerticalAlignInGroup,ВертикальноеПоложениеВГруппе", МодификацияФормПовтИсп.РазделРасположение(), Независимый, Тип("ВертикальноеПоложениеЭлемента"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "HorizontalStretch,РастягиватьПоГоризонтали", МодификацияФормПовтИсп.РазделРасположение(), Независимый, "БулевоНеопределено");
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "VerticalStretch,РастягиватьПоВертикали", МодификацияФормПовтИсп.РазделРасположение(), Независимый, "БулевоНеопределено");
	
	// Раздел "События"
	
	ЗаполнитьОбязательныеСвойстваГруппыФормы(РезультатФункции);
	//// Раздел "Оформление"
	////ЦветТекстаЗаголовка
	////ШрифтЗаголовка
	//ГоризонтальныйИнтервал
	//ВертикальныйИнтервал
	//ЦветФона
	//
	//// Раздел "Расположение"
	////Ширина
	////Высота
	////ГоризонтальноеПоложениеВГруппе
	////ВертикальноеПоложениеВГруппе
	//ГоризонтальноеПоложениеПодчиненных
	//ВертикальноеПоложениеПодчиненных
	////РастягиватьПоГоризонтали
	////РастягиватьПоВертикали
	//
	//// Раздел "События"
	
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствГруппыФормы()

Процедура ЗаполнитьОбязательныеСвойстваГруппыФормы(ОписанияСвойствЭлемента)
	ДобавитьОбязательноеСвойство(ОписанияСвойствЭлемента, "Type", ВидГруппыФормы.ОбычнаяГруппа);
КонецПроцедуры // ЗаполнитьОбязательныеСвойстваГруппыФормы()

#КонецОбласти

#Область ДекорацияФормы
	
Функция ОписанияСвойствДекорацииФормы()
	РезультатФункции = ОписаниеСвойствЭлемента();
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствДекорацииФормы()

#КонецОбласти

#Область КнопкаФормы
	
Функция ОписанияСвойствКнопкиФормы()
	РезультатФункции = ОписаниеСвойствЭлемента();
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствКнопкиФормы()

#КонецОбласти

#Область ПолеФормы
	
Функция ОписанияСвойствПоляФормы()
	РезультатФункции = ОписаниеСвойствЭлемента();
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствПоляФормы()

#КонецОбласти

#Область ТаблицаФормы
	
Функция ОписанияСвойствТаблицыФормы()
	РезультатФункции = ОписаниеСвойствЭлемента();
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствТаблицыФормы()

#КонецОбласти

#Область ОбщиеПроцедурыФункции
	
Функция ОписаниеСвойствЭлемента()
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Свойства", Новый Соответствие);
	РезультатФункции.Вставить("СоответствиеСвойств", Новый Соответствие);
	РезультатФункции.Вставить("Разделы", Разделы());
	РезультатФункции.Вставить("ОбязательныеСвойства", Новый Соответствие);
	
	Возврат РезультатФункции;
КонецФункции // ОписаниеСвойствЭлемента()

Процедура ДобавитьОбязательноеСвойство(ОписанияСвойствЭлемента, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено)
	ОписаниеОбязательногоСвойства = Новый Структура;
	ОписаниеОбязательногоСвойства.Вставить("ЗначениеПоУмолчанию", ЗначениеПоУмолчанию);
	ОписаниеОбязательногоСвойства.Вставить("Синонимы", Новый Массив);
	ОписанияСвойствЭлемента.ОбязательныеСвойства.Вставить(ВРег(СокрЛП(ИмяСвойства)), ОписаниеОбязательногоСвойства);
КонецПроцедуры // ДобавитьОбязательноеСвойство()

Функция ЗависимостьОт(ИмяПоля, ЗначениеПоля)
	РезультатФункции = Новый Структура(
	  "ИмяПоля, ЗначениеПоля",
	  ИмяПоля,
	  ЗначениеПоля
	);
	
	Возврат РезультатФункции;
КонецФункции // ЗависимостьОт()

Функция Разделы()
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделОсновные(), Новый Массив);
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделИспользование(), Новый Массив);
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделОформление(), Новый Массив);
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделРасположение(), Новый Массив);
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделСобытия(), Новый Массив);
	
	Возврат РезультатФункции;
КонецФункции // Разделы()

Процедура ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойствЭлементов, ИменаСвойстваСтрокой, ИмяРаздела, ЗависимостиТипаСвойства, ЗначенияТиповСвойства)
	ИндексОсновногоИмени = 0;
	ИменаСвойств = СтрРазделить(ИменаСвойстваСтрокой, ",");
	ИмяСвойства = СокрЛП(ИменаСвойств[ИндексОсновногоИмени]);
	ИдентификаторСвойства = ВРег(ИмяСвойства);
	
	Для Каждого Элемент Из ИменаСвойств Цикл
		ОписанияСвойствЭлементов.СоответствиеСвойств.Вставить(ВРег(СокрЛП(Элемент)), ИдентификаторСвойства);
	КонецЦикла;
	
	ОписаниеСвойства = ОписаниеСвойства();
	ОписаниеСвойства.ИмяСвойства = ИмяСвойства;
	
	Если ТипЗнч(ЗависимостиТипаСвойства) <> Тип("Массив") Тогда
		СписокЗависимостей = Новый Массив;
		СписокЗависимостей.Добавить(ЗависимостиТипаСвойства);
		СписокТипов = Новый Массив;
		СписокТипов.Добавить(ЗначенияТиповСвойства);
	Иначе
		СписокЗависимостей = ЗависимостиТипаСвойства;
		СписокТипов = ЗначенияТиповСвойства;
	КонецЕсли;
	
	ТипыСвойства = Новый Соответствие;
	Для Сч = 0 По СписокЗависимостей.Количество() - 1 Цикл
		ДобавитьТипСвойства(
		  ТипыСвойства, 
		  СписокЗависимостей[Сч].ИмяПоля,
		  СписокЗависимостей[Сч].ЗначениеПоля,
		  СписокТипов[Сч]
		);
	КонецЦИкла;
	ОписаниеСвойства.ТипыСвойства = ТипыСвойства;
	
	ОписанияСвойствЭлементов.Свойства.Вставить(ИдентификаторСвойства, ОписаниеСвойства);
	ОписанияСвойствЭлементов.Разделы[ИмяРаздела].Добавить(ИдентификаторСвойства);
КонецПроцедуры // ДобавитьОписаниеСвойстваЭлементаФормы()

Функция ОписаниеСвойства()
	РезультатФункции = Новый Структура;
	
	РезультатФункции.Вставить("ИмяСвойства", Неопределено);
	РезультатФункции.Вставить("ТипыСвойства", Неопределено);
	
	Возврат РезультатФункции;
КонецФункции // ОписаниеСвойства()

Процедура ДобавитьТипСвойства(ТипыСвойства, ИмяПоля, ЗначениеПоля, Тип)
	Ключ = Новый Соответствие;
	Ключ.Вставить("ИмяПоля", ИмяПоля);
	Ключ.Вставить("ЗначениеПоля", ЗначениеПоля);
	
	ТипыСвойства.Вставить(Ключ, Тип);
КонецПроцедуры // ДобавитьТипЭлемента()

Процедура ДополнитьОписаниеОбязательныхСвойств(ОписанияСвойствЭлементов)
	Для Каждого ОписанияСвойствЭлемента Из ОписанияСвойствЭлементов Цикл
		ОбязательныеСвойства = ОписанияСвойствЭлемента.ОбязательныеСвойства;
		
	КонецЦикла;
КонецПроцедуры // ДополнитьОписаниеОбязательныхСвойств()

#КонецОбласти

#КонецОбласти

