#Область СлужебныйПрограммныйИнтерфейс

Функция ОписанияСвойствЭлементовФормы() Экспорт 
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипГруппаФормы(), ОписанияСвойствГруппыФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипДекорацияФормы(), ОписанияСвойствДекорацииФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипКнопкаФормы(), ОписанияСвойствКнопкиФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипПолеФормы(), ОписанияСвойствПоляФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипТаблицаФормы(), ОписанияСвойствТаблицыФормы());
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствЭлементовФормы()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписанияСвойствГруппыФормы()
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Свойства", Новый Соответствие);
	РезультатФункции.Вставить("СоответствиеСвойств", Новый Соответствие);
	РезультатФункции.Вставить("Разделы", Разделы());
	
	//ДобавитьОписаниеНезависимогоСвойстваЭлементаФормы(РезультатФункции, НСтр("ru='<?>'"), МодификацияФормПовтИсп.РазделОсновные(), <?>);
	
	Независимый = ЗависимостьОт(Неопределено, Неопределено);
	ЗависитОтВидГруппаКнопок = ЗависимостьОт("Type", ВидГруппыФормы.ГруппаКнопок);
	ЗависитОтВидГруппаКолонок = ЗависимостьОт("Type", ВидГруппыФормы.ГруппаКолонок);
	ЗависитОтВидКоманднаяПанель = ЗависимостьОт("Type", ВидГруппыФормы.КоманднаяПанель);
	ЗависитОтВидКонтекстноеМеню = ЗависимостьОт("Type", ВидГруппыФормы.КонтекстноеМеню);
	ЗависитОтВидОбычнаяГруппа = ЗависимостьОт("Type", ВидГруппыФормы.ОбычнаяГруппа);
	ЗависитОтВидПодменю = ЗависимостьОт("Type", ВидГруппыФормы.Подменю);
	ЗависитОтВидСтраница = ЗависимостьОт("Type", ВидГруппыФормы.Страница);
	ЗависитОтВидСтраницы = ЗависимостьОт("Type", ВидГруппыФормы.Страницы);
	
	// Раздел "Основные"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Type,Вид", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("ВидГруппыФормы"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Title,Заголовок", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Строка"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Visible,Видимость", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Enabled,Доступность", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ReadOnly,ТолькоПросмотр", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "EnableContentChange,РазрешитьИзменениеСостава", МодификацияФормПовтИсп.РазделОсновные(), Независимый, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "DisplayImportance,ВажностьПриОтображении", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ВажностьПриОтображении"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Behavior,Поведение", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ПоведениеОбычнойГруппы"));
	ЗависимостьОтображения = Новый Массив;
	ЗависимостьОтображения.Добавить(ЗависитОтВидГруппаКнопок);
	ЗависимостьОтображения.Добавить(ЗависитОтВидОбычнаяГруппа);
	ЗависимостьОтображения.Добавить(ЗависитОтВидПодменю);
	ТипыОтображения = Новый Массив;
	ТипыОтображения.Добавить(Тип("ОтображениеГруппыКнопок"));
	ТипыОтображения.Добавить(Тип("ОтображениеОбычнойГруппы"));
	ТипыОтображения.Добавить(Тип("ОтображениеКнопки"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Representation,Отображение", МодификацияФормПовтИсп.РазделОсновные(), ЗависимостьОтображения, ТипыОтображения);
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Group,Группировка", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ГруппировкаПодчиненныхЭлементовФормы"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "United,Объединенная", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("Булево"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ThroughAlign,СквозноеВыравнивание", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("СквозноеВыравнивание"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "TitleDataPath,ПутьКДаннымЗаголовка", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("Строка"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "CurrentRowUse,ИспользованиеТекущейСтроки", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ИспользованиеТекущейСтроки"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "AssociatedTable,ИспользуемаяТаблица", МодификацияФормПовтИсп.РазделОсновные(), ЗависитОтВидОбычнаяГруппа, Тип("ТаблицаФормы"));
	
	// Раздел "Использование"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Shortcut,СочетаниеКлавиш", МодификацияФормПовтИсп.РазделИспользование(), Независимый, Тип("СочетаниеКлавиш"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ToolTip,Подсказка", МодификацияФормПовтИсп.РазделИспользование(), Независимый, Тип("Строка"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ToolTipRepresentation,ОтображениеПодсказки", МодификацияФормПовтИсп.РазделИспользование(), Независимый, Тип("ОтображениеПодсказки"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ItemsAndTitlesAlign,ВыравниваниеЭлементовИЗаголовков", МодификацияФормПовтИсп.РазделИспользование(), ЗависитОтВидОбычнаяГруппа, Тип("ВариантВыравниванияЭлементовИЗаголовков"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "ShowTitle,ОтображатьЗаголовок", МодификацияФормПовтИсп.РазделИспользование(), ЗависитОтВидОбычнаяГруппа, Тип("Булево"));
	
	// Раздел "Оформление"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "TitleTextColor,ЦветТекстаЗаголовка", МодификацияФормПовтИсп.РазделОформление(), Независимый, Тип("Цвет"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "TitleFont,ШрифтЗаголовка", МодификацияФормПовтИсп.РазделОформление(), Независимый, Тип("Шрифт"));
	
	// Раздел "Расположение"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Width,Ширина", МодификацияФормПовтИсп.РазделРасположение(), Независимый, Тип("Число"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "Height,Высота", МодификацияФормПовтИсп.РазделРасположение(), Независимый, Тип("Число"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "HorizontalAlignInGroup,ГоризонтальноеПоложениеВГруппе", МодификацияФормПовтИсп.РазделРасположение(), Независимый, Тип("ГоризонтальноеПоложениеЭлемента"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "VerticalAlignInGroup,ВертикальноеПоложениеВГруппе", МодификацияФормПовтИсп.РазделРасположение(), Независимый, Тип("ВертикальноеПоложениеЭлемента"));
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "HorizontalStretch,РастягиватьПоГоризонтали", МодификацияФормПовтИсп.РазделРасположение(), Независимый, "БулевоНеопределено");
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, "VerticalStretch,РастягиватьПоВертикали", МодификацияФормПовтИсп.РазделРасположение(), Независимый, "БулевоНеопределено");
	
	// Раздел "События"
	
	//// Раздел "Оформление"
	////ЦветТекстаЗаголовка
	////ШрифтЗаголовка
	//ГоризонтальныйИнтервал
	//ВертикальныйИнтервал
	//ЦветФона
	//
	//// Раздел "Расположение"
	////Ширина
	////Высота
	////ГоризонтальноеПоложениеВГруппе
	////ВертикальноеПоложениеВГруппе
	//ГоризонтальноеПоложениеПодчиненных
	//ВертикальноеПоложениеПодчиненных
	////РастягиватьПоГоризонтали
	////РастягиватьПоВертикали
	//
	//// Раздел "События"
	
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствГруппыФормы()

Функция ОписанияСвойствДекорацииФормы()
	РезультатФункции = Неопределено;
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствДекорацииФормы()

Функция ОписанияСвойствКнопкиФормы()
	РезультатФункции = Неопределено;
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствКнопкиФормы()

Функция ОписанияСвойствПоляФормы()
	РезультатФункции = Неопределено;
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствПоляФормы()

Функция ОписанияСвойствТаблицыФормы()
	РезультатФункции = Неопределено;
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствТаблицыФормы()

Функция ЗависимостьОт(ИмяПоля, ЗначениеПоля)
	РезультатФункции = Новый Структура(
	  "ИмяПоля, ЗначениеПоля",
	  ИмяПоля,
	  ЗначениеПоля
	);
	
	Возврат РезультатФункции;
КонецФункции // ЗависимостьОт()

Функция Разделы()
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделОсновные(), Новый Массив);
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделИспользование(), Новый Массив);
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделОформление(), Новый Массив);
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделРасположение(), Новый Массив);
	РезультатФункции.Вставить(МодификацияФормПовтИсп.РазделСобытия(), Новый Массив);
	
	Возврат РезультатФункции;
КонецФункции // Разделы()

Процедура ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияЭлементов, ИменаЭлементаСтрокой, ИмяРаздела, ЗависимостиТипаЭлемента, ЗначенияТиповЭлемента)
	ИндексОсновногоИмени = 0;
	ИменаЭлементов = СтрРазделить(ИменаЭлементаСтрокой, ",");
	ИмяЭлемента = СокрЛП(ИменаЭлементов[ИндексОсновногоИмени]);
	ИдентификаторЭлемента = ВРег(ИмяЭлемента);
	
	Для Каждого Элемент Из ИменаЭлементов Цикл
		ОписанияЭлементов.СоответствиеСвойств.Вставить(ВРег(СокрЛП(Элемент)), ИдентификаторЭлемента);
	КонецЦикла;
	
	ОписаниеЭлемента = ОписаниеЭлемента();
	ОписаниеЭлемента.ИмяЭлемента = ИмяЭлемента;
	
	Если ТипЗнч(ЗависимостиТипаЭлемента) <> Тип("Массив") Тогда
		СписокЗависимостей = Новый Массив;
		СписокЗависимостей.Добавить(ЗависимостиТипаЭлемента);
		СписокТипов = Новый Массив;
		СписокТипов.Добавить(ЗначенияТиповЭлемента);
	Иначе
		СписокЗависимостей = ЗависимостиТипаЭлемента;
		СписокТипов = ЗначенияТиповЭлемента;
	КонецЕсли;
	
	ТипыЭлемента = Новый Соответствие;
	Для Сч = 0 По СписокЗависимостей.Количество() - 1 Цикл
		ДобавитьТипЭлемента(
		  ТипыЭлемента, 
		  СписокЗависимостей[Сч].ИмяПоля,
		  СписокЗависимостей[Сч].ЗначениеПоля,
		  СписокТипов[Сч]
		);
	КонецЦИкла;
	ОписаниеЭлемента.ТипыЭлемента = ТипыЭлемента;
	
	ОписанияЭлементов.Свойства.Вставить(ИдентификаторЭлемента, ОписаниеЭлемента);
	ОписанияЭлементов.Разделы[ИмяРаздела].Добавить(ИдентификаторЭлемента);
КонецПроцедуры // ДобавитьОписаниеСвойстваЭлементаФормы()

Процедура ДобавитьОписаниеНезависимогоСвойстваЭлементаФормы(ОписанияЭлементов, ИменаЭлементаСтрокой, ИмяРаздела, ТипЭлемента)
	ИндексОсновногоИмени = 0;
	ИменаЭлементов = СтрРазделить(ИменаЭлементаСтрокой, ",");
	ИмяЭлемента = СокрЛП(ИменаЭлементов[ИндексОсновногоИмени]);
	ИдентификаторЭлемента = ВРег(ИмяЭлемента);
	
	Для Каждого Элемент Из ИменаЭлементов Цикл
		ОписанияЭлементов.СоответствиеСвойств.Вставить(ВРег(СокрЛП(Элемент)), ИдентификаторЭлемента);
	КонецЦикла;
	
	ОписаниеЭлемента = ОписаниеЭлемента();
	
	ОписаниеЭлемента.ИмяЭлемента = ИмяЭлемента;
	//ОписаниеЭлемента.ИмяРаздела = ИмяРаздела;
	ОписаниеЭлемента.ЗависитОт = Неопределено;
	ТипыЭлемента = Новый Соответствие;
	ДобавитьТипЭлемента(ТипыЭлемента, Неопределено, Неопределено, ТипЭлемента);
	ОписаниеЭлемента.ТипыЭлемента = ТипыЭлемента;
	
	ОписанияЭлементов.Свойства.Вставить(ИдентификаторЭлемента, ОписаниеЭлемента);
	ОписанияЭлементов.Разделы[ИмяРаздела].Добавить(ИдентификаторЭлемента);
КонецПроцедуры // ДобавитьОписаниеСвойстваЭлементаФормы()

Функция ОписаниеЭлемента()
	РезультатФункции = Новый Структура;
	
	РезультатФункции.Вставить("ИмяЭлемента", Неопределено);
	//РезультатФункции.Вставить("ИмяРаздела", Неопределено);
	//РезультатФункции.Вставить("ЗависитОт", Неопределено);
	РезультатФункции.Вставить("ТипыЭлемента", Неопределено);
	
	Возврат РезультатФункции;
КонецФункции // ОписаниеЭлемента()

Процедура ДобавитьТипЭлемента(ТипыЭлемента, ИмяПоля, ЗначениеПоля, Тип)
	Ключ = Новый Соответствие;
	Ключ.Вставить("ИмяПоля", ИмяПоля);
	Ключ.Вставить("ЗначениеПоля", ЗначениеПоля);
	
	ТипыЭлемента.Вставить(Ключ, Тип);
КонецПроцедуры // ДобавитьТипЭлемента()

#КонецОбласти

