#Область СлужебныйПрограммныйИнтерфейс

Функция ОписанияСвойствЭлементовФормы()
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипГруппаФормы(), ОписанияСвойствГруппыФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипДекорацияФормы(), ОписанияСвойствДекорацииФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипКнопкаФормы(), ОписанияСвойствКнопкиФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипПолеФормы(), ОписанияСвойствПоляФормы());
	РезультатФункции.Вставить(МодификацияФормПовтИсп.ТипТаблицаФормы(), ОписанияСвойствТаблицыФормы());
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствЭлементовФормы()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписанияСвойствГруппыФормы()
	РезультатФункции = Новый Структура;
	
	// Раздел "Основные"
	ДобавитьОписаниеСвойстваЭлементаФормы(РезультатФункции, НСтр("ru='Вид'"), МодификацияФормПовтИсп.РазделОсновные(), , Тип("ВидГруппыФормы"));
	Заголовок
	Видимость
	Доступность
	ТолькоПросмотр
	РазрешитьИзменениеСостава
	
	// Раздел "Использование"
	СочетаниеКлавиш
	Подсказка
	ОтображениеПодсказки
	
	// Раздел "Оформление"
	ЦветТекстаЗаголовка
	ШрифтЗаголовка
	
	// Раздел "Расположение"
	Ширина
	Высота
	ГоризонтальноеПоложениеВГруппе
	ВертикальноеПоложениеВГруппе
	РастягиватьПоГоризонтали
	РастягиватьПоВертикали

	// Раздел "События"
	
	// Раздел "Основные"
	//Заголовок
	//Видимость
	ПользовательскаяВидимость
	//Доступность
	//ТолькоПросмотр
	//РазрешитьИзменениеСостава
	ВажностьПриОтображении
	Поведение
	Отображение
	Группировка
	Объединенная
	СквозноеВыравнивание
	ПутьКДаннымЗаголовка
	ИспользованиеТекущейСтроки
	ИспользуемаяТаблица
	
	// Раздел "Использование"
	//СочетаниеКлавиш
	//Подсказка
	//ОтображениеПодсказки
	ВыравниваниеЭлементовИЗаголовков
	ОтображатьЗаголовок
	
	// Раздел "Оформление"
	//ЦветТекстаЗаголовка
	//ШрифтЗаголовка
	ГоризонтальныйИнтервал
	ВертикальныйИнтервал
	ЦветФона
	
	// Раздел "Расположение"
	//Ширина
	//Высота
	//ГоризонтальноеПоложениеВГруппе
	//ВертикальноеПоложениеВГруппе
	ГоризонтальноеПоложениеПодчиненных
	ВертикальноеПоложениеПодчиненных
	//РастягиватьПоГоризонтали
	//РастягиватьПоВертикали
	
	// Раздел "События"
	
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствГруппыФормы()

Функция ОписанияСвойствДекорацииФормы()
	РезультатФункции = Неопределено;
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствДекорацииФормы()

Функция ОписанияСвойствКнопкиФормы()
	РезультатФункции = Неопределено;
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствКнопкиФормы()

Функция ОписанияСвойствПоляФормы()
	РезультатФункции = Неопределено;
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствПоляФормы()

Функция ОписанияСвойствТаблицыФормы()
	РезультатФункции = Неопределено;
	
	Возврат РезультатФункции;
КонецФункции // ОписанияСвойствТаблицыФормы()

Процедура ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияЭлементов, ИмяЭлемента, ИмяРаздела, ТипЭлемента)
	ОписаниеЭлемента = Новый Структура;
	ИдентификаторЭлемента = ВРег(ИмяЭлемента);
	
	ОписанияЭлементов.Вставить(ИдентификаторЭлемента, ОписаниеЭлемента);
КонецПроцедуры // ДобавитьОписаниеСвойстваЭлементаФормы()


#КонецОбласти

