#Область СлужебныйПрограммныйИнтерфейс

#Область ИдентификаторыСтрок

Функция ЭтоСтрокаРеквизита(Идентификатор) Экспорт 
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("РЕКВИЗИТ");
	
	Возврат Идентификаторы.Найти(Идентификатор) <> Неопределено;
КонецФункции // ЭтоСтрокаРеквизита()

Функция ЭтоСтрокаТипаРеквизита(Идентификатор) Экспорт 
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("ТИПРЕКВИЗИТА");
	
	Возврат Идентификаторы.Найти(Идентификатор) <> Неопределено;
КонецФункции // ЭтоСтрокаРеквизита()

Функция ЭтоСтрокаЭлемента(Идентификатор) Экспорт 
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("ЭЛЕМЕНТ");
	
	Возврат Идентификаторы.Найти(Идентификатор) <> Неопределено;
КонецФункции // ЭтоСтрокаРеквизита()

Функция ЭтоСтрокаСвойстваЭлемента(Идентификатор) Экспорт 
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("СВОЙСТВОЭЛЕМЕНТА");
	
	Возврат Идентификаторы.Найти(Идентификатор) <> Неопределено;
КонецФункции // ЭтоСтрокаСвойстваЭлемента()

Функция ЭтоСтрокаОбработчикаЭлемента(Идентификатор) Экспорт 
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("ОБРАБОТЧИКЭЛЕМЕНТА");
	
	Возврат Идентификаторы.Найти(Идентификатор) <> Неопределено;
КонецФункции // ЭтоСтрокаОбработчикаЭлемента()

#КонецОбласти

#Область ИдентификаторыТиповЭлементов

Функция ЭтоДекорацияФормы(Идентификатор) Экспорт
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("ДЕКОРАЦИЯФОРМЫ");
	
	Возврат Идентификаторы.Найти(Идентификатор) <> Неопределено;
КонецФункции // ЭтоДекорацияФормы()

Функция ЭтоГруппаФормы(Идентификатор) Экспорт
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("ГРУППАФОРМЫ");
	
	Возврат Идентификаторы.Найти(Идентификатор) <> Неопределено;
КонецФункции // ЭтоГруппаФормы()

Функция ЭтоКнопкаФормы(Идентификатор) Экспорт
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("КНОПКАФОРМЫ");
	
	Возврат Идентификаторы.Найти(Идентификатор) <> Неопределено;
КонецФункции // ЭтоКнопкаФормы()

Функция ЭтоТаблицаФормы(Идентификатор) Экспорт
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("ТАБЛИЦАФОРМЫ");
	
	Возврат Идентификаторы.Найти(Идентификатор) <> Неопределено;
КонецФункции // ЭтоТаблицаФормы()

Функция ЭтоПолеФормы(Идентификатор) Экспорт
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("ПОЛЕФОРМЫ");
	
	Возврат Идентификаторы.Найти(Идентификатор) <> Неопределено;
КонецФункции // ЭтоПолеФормы()

#КонецОбласти

#Область ТипыЭлементовФормы
	
Функция ТипДекорацияФормы() Экспорт
	Возврат Тип("ДекорацияФормы");
КонецФункции // ТипДекорацияФормы()

Функция ТипГруппаФормы() Экспорт
	Возврат Тип("ГруппаФормы");
КонецФункции // ТипГруппаФормы()

Функция ТипКнопкаФормы() Экспорт
	Возврат Тип("КнопкаФормы");
КонецФункции // ТипКнопкаФормы()

Функция ТипТаблицаФормы() Экспорт
	Возврат Тип("ТаблицаФормы");
КонецФункции // ТипТаблицаФормы()

Функция ТипПолеФормы() Экспорт
	Возврат Тип("ПолеФормы");
КонецФункции // ТипПолеФормы()

#КонецОбласти

#Область ПрочиеИдентификаторы

Функция ЭтоИдентификаторФормы(Идентификатор) Экспорт 
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("ФОРМА");
	
	Возврат Идентификаторы.Найти(Идентификатор) <> Неопределено;
КонецФункции // ЭтоИдентификаторФормы()
	
#КонецОбласти

#КонецОбласти
